{
  "en": {
    "titleSectionAbout": "About Me",
    "paragraph1": "Welcome! I'm Martha. I grew up between France and Spain and I am now based in Vancouver, BC.",
    "paragraph2": "My interest in web development started to flourish in 2018 when I wanted to help my parents build a website for their pizzeria in Spain.",
    "paragraph3": "I finally took the leap to pursue programming seriously by enrolling in the Front-End Development program at BCIT.",
    "paragraph4": "When I'm not refining my skills on the laptop, you can find me hiking with my dog, singing, ",
    "youtubeLink": "playing musical instruments",
    "QuillerinaLink": ", creating art with paper",
    "paragraph4-continued": " (website coming soon), and actively engaging in the flamenco community.",
    "seePhotosCTA": "Browse my photos",
    "techStack": "My Tech Stack:"
  },
  "fr": {
    "titleSectionAbout": "À propos de moi",
    "paragraph1": "Bienvenu(e)s! Je suis Martha. J'ai grandi entre la France et l'Espagne et je suis maintenant basée à Vancouver, en Colombie-Britannique.",
    "paragraph2": "Mon intérêt pour le développement web a commencé à s'épanouir en 2018 lorsque j'ai voulu aider mes parents à construire un site web pour leur pizzeria en Espagne.",
    "paragraph3": "J'ai finalement franchi le pas pour me consacrer sérieusement à la programmation en m'inscrivant au programme de développement Front-End à BCIT.",
    "paragraph4": "Quand je ne suis pas en train de perfectionner mes compétences sur l'ordinateur, vous pouvez me trouver en train de faire de la randonnée avec mon chien, de chanter, de ",
    "youtubeLink": "jouer des instruments de musique",
    "QuillerinaLink": ", de créer de l'art avec du papier",
    "paragraph4-continued": "  (site web à venir) et de m'impliquer activement dans la communauté flamenco.",
    "seePhotosCTA": "Parcourir mes photos",
    "techStack": "Mon Stack technologique:"
  },
  "es": {
    "titleSectionAbout": "Sobre mí",
    "paragraph1": "¡Bienvenido(a)s! Soy Martha. Crecí entre Francia y España y ahora vivo en Vancouver, Columbia Británica.",
    "paragraph2": "Mi interés por el desarrollo web comenzó a florecer en 2018 cuando quise ayudar a mis padres a construir un sitio web para su pizzería en España.",
    "paragraph3": "Finalmente di el paso para dedicarme seriamente a la programación al inscribirme en el programa de Desarrollo Front-End en BCIT.",
    "paragraph4": "Cuando no estoy perfeccionando mis habilidades en la computadora, me encontrarás haciendo senderismo con mi perro, cantando, ",
    "youtubeLink": "tocando instrumentos musicales",
    "QuillerinaLink": ",  creando arte con papel",
    "paragraph4-continued": " (próximamente un sitio web) y participando activamente en la comunidad de flamenco.",
    "seePhotosCTA": "Ver mis fotos",
    "techStack": "Mi stack tecnológico:"
  }
}
