{
  "projects": {
    "selected": {
      "en": {
        "titleSectionProjects": "Projects",
        "introSelectedProjects": "Discover a diverse range of projects, from featured works to learning experiences, in the Workshop section. Stay tuned for more updates!",
        "buttonProjectTitleFeatured": "Selected",
        "buttonProjectTitleAll": "All ",
        "buttonProjectTitleWorkshop": "Workshop",
        "projects": [
          {
            "workshop": false,
            "featured": true,
            "id": "1",
            "title": "Flixr",
            "slug": "flixr",
            "thumbnail": "/images/flix3.png",
            "thumbnailMobile": "/images/flix-mobile.png",
            "alt": "Flixr Movie Screenshot",
            "skills": [
              "SCSS",
              "React",
              "RestAPI",
              "JSX",
              "PhotoShop",
              "GitHub",
              "AdobeXD"
            ],
            "excerpt": "A movie database built in React.js using themoviedb.org API that enables users to explore, search, and bookmark movies.",
            "gitHubLink": "https://github.com/piracode/flixr_react",
            "liveSiteLink": "https://martha.codes/flixr/",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Details",
            "post": {
              "titleOverview": "Overview",
              "overview1": "A movie database built in React.js, utilizing the themoviedb.org API. It incorporates a feature that allows users to add movies to their favorites, with persistent storage ensured through local storage.",
              "overview2": "In addition, a mockup was created using Photoshop and a prototype was developed using Adobe XD to visualize the design and functionality of the application.",
              "accordions": [
                {
                  "title": "Project Requirements",
                  "content": "The project involved building an app connected to the themoviedb.org API. The main requirement was to create a homepage that displays a grid of movies, sortable by popularity, top ratings, current releases, and upcoming releases",
                  "content1": "Each movie card on the grid should link to a detailed movie page, showcasing additional information like a summary and a backdrop image. Additionally, a favorites page was implemented to show the user's selected movies.",
                  "content2": "The ability to add or remove favorites was implemented on the homepage, movie pages, and the favorites page using local storage."
                },
                {
                  "title": "UX / UI Design",
                  "intro": "NOTE: The following steps do not reflect the design of 'Flixr'. This was a school project where each of us worked individually on our own design. For the development phase, we selected one design from the group. However, I still wanted to share the process I went through and the skills I acquired.",
                  "content": "The design of the application underwent several stages. Firstly, I created a logo using Adobe Illustrator, followed by creating a mockup using Photoshop, and finally developing a prototype using Adobe XD. ",
                  "tabs": [
                    {
                      "subtitle": "Adobe Suite",
                      "heading": "Illustrator",
                      "content": "In the design section of the movie database, I took inspiration from the design of Netflix. The application's visual elements, such as the logo, were created using Adobe Illustrator, and the chosen color scheme was based on Netflix's colors.",
                      "image": {
                        "src": "/images/cinevoxLogo.png",
                        "alt": "Cinevox Logo"
                      },
                      "heading1": "Photoshop",
                      "content1": "I utilized Photoshop's tools and features to create a professional and visually appealing mockup.",
                      "image1": {
                        "src": "/images/cinevox.png",
                        "alt": "Cinevox Mockup"
                      },
                      "CTALink1": {
                        "href": "https://assets.adobe.com/id/urn:aaid:sc:VA6C2:5aca45c3-aa62-4da0-a5ac-57504ff0246a?view=published",
                        "text": "Photoshop Mockup"
                      },
                      "heading2": "Adobe XD",
                      "content2": "I then created a prototype with Adobe XD. To view the prototype, click the links below.",
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/2d9451e4-022e-49a6-832a-e6ae6c015e3f-78c7/",
                        "text": "Cinevox Mobile Prototype"
                      },
                      "CTALink3": {
                        "href": "https://xd.adobe.com/view/434de7ae-72b2-493c-9718-02b378d22115-161e/",
                        "text": "Cinevox Desktop Prototype"
                      }
                    },
                    {
                      "subtitle": "Final Design",
                      "content": "During the development phase in React, our team of 3 collectively agreed to adopt the design crafted by my classmate.",
                      "content1": "This decision led to the incorporation of design elements from both our original mockup and our classmate's design contributions in the final design of the movie database.",
                      "content2": "To view the design, please click on the following link:",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/d9bc98ca-40b8-426c-b14c-f3ffee1e3a5a-8cef/",
                        "text": "Flixr Prototype"
                      }
                    }
                  ]
                },

                {
                  "title": "Development Highlights",
                  "intro": "During my work on the Movie Database, I gained valuable experience in team collaboration using GitHub.",
                  "content": "I explored various React features that greatly influenced my experience and growth. Let's focus on two standout topics in this summary.",
                  "tabs": [
                    {
                      "subtitle": "Search Feature",
                      "heading": "UseLocation Hook",

                      "content": "The useLocation hook returns an object that represents the current URL and provides various properties and methods to access different parts of the URL. In our app, useLocation is used to get the current location object",
                      "content1": "By using the location.search property, which represents the query string portion of the URL, the code extracts the value of the 'query' parameter from the URL. This allows the code to retrieve the search query entered by the user, which can be used to fetch relevant movies or display an error message if no movies are found.",
                      "heading1": "URLSearchParams API",
                      "content2": "The URLSearchParams is a built-in JavaScript API that provides methods to work with the query string of a URL. It allows you to parse and manipulate the parameters in the URL's query string.",

                      "content3": "'new URLSearchParams'(location.search) creates a new URLSearchParams object using the location.search property, which represents the query string part of the current URL. Then, .get('query') is called on that object to retrieve the value of the 'query' parameter from the URL. This extracts the search query entered by the user.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/pages/SearchResults.js",
                        "text": "GitHub Link"
                      }
                    },
                    {
                      "subtitle": "REST API Fetching",
                      "content": "We practiced and implemented both async/await and fetch methods for data fetching.",
                      "heading": "Async/Await",
                      "content2": "With async/await, we were able to write asynchronous code that looks and feels more like traditional synchronous code, making it easier to handle tasks that require time.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/api.js",
                        "text": "GitHub Link"
                      },
                      "heading1": "Fetch/Then/Catch",
                      "content1": "We also explored the fetch method, which allows us to send requests to retrieve data from external sources. By utilizing then and catch methods, we were able to handle the response and potential errors effectively.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/toolbelt.js",
                        "text": "GitHub Link"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospective",
                  "question": "What did I learn?",
                  "content": "Throughout this project, I acquired valuable skills in logo creation, mockup design, prototype development, and React.js. Encountering bugs reinforced the importance of thorough testing and debugging for a seamless user experience. This experience highlighted the significance of meticulous bug fixing and code refactoring to enhance the overall code quality.",
                  "question1": "What could be improved?",
                  "content2": "We recognized the importance of meticulous testing to ensure a robust and reliable application. Additionally, we identified bugs in the favorite functionality post-deployment, which require refactoring to ensure smooth operation.",
                  "content1": "Furthermore, there is an opportunity to enhance the design by incorporating additional movie details such as casting information and YouTube video links for trailers."
                }
              ]
            },
            "design": false
          },

          {
            "workshop": false,
            "featured": true,
            "id": "3",
            "title": "www.martha.codes",
            "slug": "martha-portfolio",
            "thumbnail": "/images/portfolio-desktop.png",
            "thumbnailMobile": "/images/portfolio-mobile.png",
            "skills": ["React", "JSX", "CSS", "SCSS", "JSON", "AdobeXD"],
            "excerpt": "My portfolio is a multilingual site that showcases a React project where I fetch data from a JSON API. It features captivating animations and includes a dark/light theme option, project sorting, and upcoming plans to add an input search functionality.",
            "gitHubLink": "https://github.com/piracode/portfolio_CRA",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Details",
            "post": {
              "titleOverview": "Overview",
              "overview1": "My portfolio project aims to showcase my skills as a front-end developer and UX designer through a curated selection of my best works, reflecting my attention to detail and user-centered design approach.",
              "accordions": [
                {
                  "title": "Project Requirements",
                  "content": "- Create a professional and consistent portfolio that showcases selected projects, reflects my personal branding, and provides easy contact options for potential employers.",
                  "content1": "- Develop a captivating user experience that effectively communicates my skills, expertise, and passion for front-end development and UX design.",
                  "content2": "- Demonstrate a range of projects, including both selected works and practice projects, to showcase problem-solving abilities, user-centered design approach, and the impact of my work.Additionally, incorporate aspects of my personal interests and hobbies to provide a well-rounded view of who I am as a professional."
                },
                {
                  "title": "UX / UI Design",
                  "intro": "",
                  "tabs": [
                    {
                      "subtitle": "Adobe XD",
                      "heading1": "Site Map",
                      "content1": "I developed a site map to organize and visualize the structure of my portfolio. It allowed me to plan pages, sections, and navigation paths effectively, providing a clear overview of the website's architecture. The site map was a valuable reference, ensuring a well-organized and user-friendly website.",
                      "CTALink3": {
                        "href": "/images/PDF/portfolio-site-map.pdf",
                        "text": "Portfolio Site Map PDF"
                      },
                      "heading": "Prototype",
                      "content": "Afterwards, I developed a prototype of the website to practice prototyping and explore different visual styles. Taking inspiration from Brittany Chiang's design, I incorporated elements that resonated with my vision. Additionally, I added extra functionality, including a dark/light theme, to enhance the user experience.",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/51d86c46-805d-4afe-bbd7-e86bc174db39-048b/",
                        "text": "Mobile Portfolio Prototype"
                      },
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/d783c70e-7df2-47e1-af60-b05c435aa56a-82d0/",
                        "text": "Desktop Portfolio Prototype"
                      }
                    },
                    {
                      "subtitle": "Final Design",
                      "heading": "Improved Navigation",
                      "content": "After receiving valuable feedback from a teacher, I reworked the navigation on my website. I replaced the hamburger menu with a more user-friendly approach, ensuring the navigation is easily accessible at the bottom on mobile and on the right side on desktop. This enhancement significantly improved the overall user experience.",
                      "heading1": "Multilingual site",
                      "content1": "To highlight my multilingual skills, I implemented a translation feature on my website. This allows users to switch between different languages, enhancing their browsing experience and facilitating effective communication.",
                      "heading2": "Accordions/Tabs",
                      "content2": "To ensure a concise yet informative presentation of my projects, I utilized accordions and tabs. This allowed me to include ample details without overwhelming the user with excessive content length, resulting in a more organized and user-friendly browsing experience."
                    }
                  ]
                },
                {
                  "title": "Development Highlights",
                  "intro": "I want to highlight two key aspects of my development process: the i18n library and the implementation of a Dark/Light theme. These features enhance user experience and accessibility. Let's delve into them:",

                  "tabs": [
                    {
                      "subtitle": "i18n Library",
                      "heading": "internationalization File",
                      "content": "I imported the necessary modules for internationalization (i18n) and created this file.",
                      "content1": "It loads translation data from JSON files for different sections of the application, merges them into language-specific objects, and initializes the i18n library with the loaded resources.",
                      "content2": "The translations can then be accessed using the t object in other files, providing multilingual support for the application.",
                      "heading1": "JSON Files",
                      "content3": "The JSON files contain language-specific objects with key-value pairs representing different translations. Each language object (en, fr, es) includes translations for various phrases used in the application.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/utilities/i18n.js",
                        "text": "i18n file GitHub Link"
                      }
                    },
                    {
                      "subtitle": "Dark/Light theme",
                      "heading": "UseContext Hook",
                      "content2": "Using the useContext hook, I implemented a dark/light theme feature in my application. By adding the class 'light' or 'dark' to the top-level component, I dynamically changed the theme based on user preference. The ThemeToggleButton component allows users to toggle between the themes, and the ThemeContext provides access to the current theme status throughout the application.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/App.js",
                        "text": "App.js GitHub Link"
                      },
                      "CTALink2": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/components/ThemeToggleButton.js",
                        "text": "ThemeToggleButton.js GitHub Link"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospective",
                  "question": "What did I learn?",
                  "content": "During this project, I deepened my knowledge of React and explored various hooks that I hadn't used before. Implementing the i18n library was a long-awaited achievement for me.",
                  "content1": "I discovered that while libraries can save time, it's crucial to invest time in understanding their usage. Sometimes, learning to use a library effectively can be as time-consuming as building the functionality ourselves.",
                  "question1": "What could be improved?",
                  "content2": "Several areas could be improved. I rushed into development without properly planning the structure of the JSON file. I should have kept the translations for each language separate instead of combining them into a single file. This approach worked well for most files but made the projects.json file excessively long and difficult to maintain. Refactoring that structure is a priority.",
                  "content3": "I need to rectify how I accessed translations in some files. Instead of using the t object, I mistakenly used the i18n object, which unnecessarily complicated things.",
                  "content5": "I plan to improve the Accordion file by implementing consistent naming conventions, adding descriptive comments, and organizing the code into smaller, modular functions or components. These changes will enhance code readability, maintainability, and reusability.",
                  "question2": "What's next?",
                  "content4": "In the future, I plan to add supplementary search functionality that allows users to search projects based on skills. Additionally, integrating Google Analytics is on my roadmap."
                }
              ]
            },
            "design": false
          },
          {
            "workshop": false,
            "featured": true,
            "id": "4",
            "title": "Ai Summit(Coming soon)",
            "slug": "ai-summit",
            "thumbnail": "/images/placeholder.png",
            "skills": ["Wordpress", "WooCommerce", "PHP", "SASS", "GitHub"],
            "excerpt": "We are currently developing a WooCommerce site as a team of four. The purpose of the site is to sell tickets for a conference focused on Artificial Intelligence.",
            "gitHubLink": "https://github.com/piracode",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Details",
            "post": {
              "intro": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia.",
              "content": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia."
            },
            "design": false
          },
          {
            "workshop": true,
            "featured": false,
            "id": "2",
            "title": "Lord of the Rings",
            "slug": "matching-game",
            "thumbnail": "/images/matchingGameDesktop.png",
            "thumbnailMobile": "/images/matchingGameMobile.png",
            "alt": "Matching Game Lord of the Rings Screenshot",
            "skills": ["HTML", "CSS", "JavaScript"],
            "excerpt": "A matching game with added sound effects, implemented in JavaScript and CSS.",
            "gitHubLink": "https://github.com/piracode/matching-game/tree/master",
            "liveSiteLink": "https://martha.codes/matching-game/",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Details",
            "post": {
              "titleOverview": "Overview",
              "overview1": "A memory matching game implemented in JavaScript, which consists of a grid of cards that the player needs to flip and match in pairs, keeping track of their matches, guesses, and remaining lives.",
              "accordions": [
                {
                  "title": "Project Requirements",
                  "content": "The game required creating a single-player experience where the user had to match pairs of hidden pictures on a grid.",
                  "content1": "The player can reveal up to two pictures in a turn, and if the pictures match, they remain revealed. If the pictures do not match, they return to being hidden after a certain time.",
                  "content2": "The game should keep track of the player's turns, matches, and provide a start button and the option to end the game at any time."
                },
                {
                  "title": "Development Highlights",
                  "intro": "I gained experience in utilizing various HTML elements and classes, manipulating the DOM, implementing event listeners, and managing game state variables.",
                  "tabs": [
                    {
                      "subtitle": "DOM Manipulation",
                      "content": "Throughout the game development, I worked extensively with HTML elements, such as divs, buttons, headings, and images, to structure and present the user interface. ",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Matching Game GitHub Link"
                      }
                    },
                    {
                      "subtitle": "Game State Management",
                      "content": "To enable user interaction, I implemented event listeners that responded to actions like clicks or key presses. By attaching these event listeners to specific HTML elements, I could trigger appropriate actions and functions based on user input.",
                      "content1": "Additionally, I managed the game's state variables, including lockCards, flippedCards, matches, guesses, and livesLeft. These variables played a crucial role in tracking the game's progress, implementing rules and mechanics, controlling the flow of the game, and updating the display accordingly. ",
                      "content2": "This comprehensive approach to event handling and game state management resulted in an engaging and interactive game experience for the players.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Matching Game GitHub Link"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospective",
                  "question": "What did I learn?",
                  "content": "In addition to managing game state variables and manipulating the DOM, I also acquired fundamental CSS skills, including flexbox and CSS grid. Furthermore, I gained knowledge and proficiency in implementing sound effects within the game.",
                  "question1": "What could be improved?",
                  "content2": "I want to improve my code by changing the way I approach it. Currently, I rely mostly on functions, but I plan to switch to using objects more extensively. By using objects as the main components of my code, I can make it better organized, structured, and easier to reuse in different parts of the game. This change will bring several benefits and help me create a more efficient and maintainable codebase.",
                  "content1": " I would love to enhance the User Interface (UI) and create a more captivating experience."
                }
              ]
            },
            "design": false
          },
          {
            "workshop": false,
            "featured": true,
            "id": "8",
            "title": "French Baking App - Case Study",
            "slug": "french-baking-case-study",
            "thumbnail": "/images/pic-frenchBaking.png",
            "skills": [
              "User Research",
              "User Personas",
              "Usability Testing",
              "Interaction Design",
              "Wireframing",
              "Prototyping",
              "Figma"
            ],
            "excerpt": "Conducted a comprehensive case study during the Google UX Certificate program, focusing on designing a fictional French baking app using Figma.",
            "liveSiteCTA": "Prototype",
            "liveSiteLink": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141&mode=design",
            "detailsCTA": "Details",
            "pdfCTA": "PDF",
            "pdfLink": "/images/PDF/frenchBaking.pdf",
            "post": {
              "titleOverview": "Overview",
              "overview1": "This case study delves into the development of a fictional French Baking App, completed as part of the UX Google Certificate program. While the quality of this work may not meet my highest standards, I aim to showcase it as a testament to the knowledge and skills gained throughout the process. The study encompasses various phases, including UX Analysis, UX Design and Prototyping, and concludes with a retrospective evaluation",
              "accordions": [
                {
                  "title": "UX Analysis",
                  "tabs": [
                    {
                      "subtitle": "Problem Understanding and Research",
                      "heading": "Problem Definition/Goal",
                      "content": "The problem definition/goal for this project is to create an app that addresses the challenge of long lineups for busy customers at French Baking, enabling them to pre-order for pick-up or delivery, saving time and providing convenience.",
                      "heading1": "User Research",
                      "content1": "User research was conducted to gain insights into the preferences and needs of the target customers at French Baking. This research aimed to understand their ordering behaviors and identify pain points, informing the development of the app."
                    },
                    {
                      "subtitle": "User Analysis and Insights",
                      "content": "One primary user group identified during the research process was busy adults who desired a convenient way to order from French Baking without waiting in long lineups. ",
                      "heading": "Pain Points Identification",
                      "content2": "Key pain points identified during user research include time constraints for working adults and busy students, disappointment caused by out of stock items, and the absence of an app for pre-ordering at the bakery.",
                      "heading1": "Persona development",
                      "content3": "A detailed persona named Nate was created during the development phase to represent the target user, providing valuable insights into their characteristics, needs, and goals. Nate's persona guided design decisions and feature prioritization for the French Baking app.",
                      "heading2": "User Journey Mapping",
                      "content4": "User journey mapping identified touchpoints, emotions, and pain points in the app's user experience, revealing insights for user-centered design and development.",
                      "image1": {
                        "src": "/images/journeyMap.png",
                        "alt": "Journey Map French Baking"
                      }
                    }
                  ]
                },
                {
                  "title": "UX Design and Prototyping",
                  "intro": "During the UX Design and Prototyping phase, several key activities were conducted to shape the app's design and create prototypes for testing and evaluation.",

                  "tabs": [
                    {
                      "subtitle": "Wireframing",
                      "heading": "Paper Wireframe",
                      "content": "Initial sketches and basic layouts were created on paper to establish the visual structure and organization of the app.",
                      "heading1": "Digital Wireframe",
                      "content1": "The paper wireframes were translated into digital form, allowing for more detailed visualization and interaction design.",
                      "CTALink1": {
                        "href": "https://www.figma.com/file/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=0-1&mode=design&t=TeIG3EDCeZN8dDUH-0",
                        "text": "Digital Wireframes Figma Link"
                      },
                      "heading2": "Low-fi Prototype",
                      "content2": "A low-fidelity prototype was developed, providing a basic representation of the app's functionality and user interface. This prototype allowed for early user testing and feedback to refine the design.",
                      "CTALink2": {
                        "href": "https://www.figma.com/proto/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=12-107&scaling=scale-down&page-id=0%3A1&starting-point-node-id=1%3A3&mode=design",
                        "text": "Figma Link Low-fi Prototype"
                      }
                    },
                    {
                      "subtitle": "Usability Findings",
                      "content": "Usability testing was conducted to gather feedback and insights from users interacting with the low-fidelity prototype. The findings helped identify usability issues, refine the design, and enhance the overall user experience",
                      "content1": "Usability findings indicated that users preferred a less cluttered homepage, wanted information about pick-up and delivery presented once, and favored a separate section for personalized options."
                    },
                    {
                      "subtitle": "Mockup",
                      "heading": "Mockup",
                      "content": "A visual representation of the app's interface design was created to showcase the overall look and feel.",
                      "heading1": "High Fidelity Prototype",
                      "content1": "A fully interactive and visually polished prototype was developed, simulating the app's functionality and providing a realistic user experience",
                      "content2": "NOTE: The prototype provided is not fully functional, as certain features like navigation have not been implemented. However, I have plans to continue working on it to improve its functionality.",
                      "CTALink1": {
                        "href": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141",
                        "text": "High Fidelity Prototype Figma Link"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospective",
                  "question": "What did I learn?",
                  "content": "During this case study, I gained valuable insights and knowledge about various aspects of user experience design, including problem definition, user research, pain point identification, persona development, user journey mapping, wireframing, usability testing, and prototyping. I also learned the importance of allowing sufficient time for each phase of the design process to ensure higher quality outcomes.",
                  "question1": "What could be improved?",
                  "content2": "I rushed through this case study to complete the Google UX Certificate and avoid paying monthly fees for an extended period. I pursued this certificate as a personal learning experience. Regrettably, the rushed process resulted in a mediocre user interface and various issues with the PDF.",
                  "content3": " Despite its shortcomings, I still want to share it because it provided valuable insights. The rushed timeline compromised the quality, but with my increased knowledge and experience, I recognize the potential for significant improvement with more time and effort."
                }
              ]
            },
            "design": true
          },

          {
            "workshop": false,
            "featured": true,
            "id": "9",
            "title": "Best Buy Usability Report",
            "slug": "best-buy-usability-report",
            "thumbnail": "/images/best-buy-desktop.png",
            "thumbnailMobile": "/images/best-buy-mobile.png",

            "skills": [
              "Usability Evaluation",
              "Research Methodology",
              "Data Analysis",
              "Report Writing"
            ],
            "excerpt": "In a collaborative effort with a team of five, we conducted a comprehensive usability report for Best Buy, assessing its user experience and documenting key findings.",
            "liveSiteCTA": "Prototype",
            "pdfLink": "/images/PDF/best_buy.pdf",
            "pdfCTA": "PDF",
            "detailsCTA": "Details",
            "post": {
              "titleOverview": "Overview",
              "overview1": "The Best Buy Usability Report aims to evaluate the user experience and provide actionable recommendations for improvement. The report consists of several sections, each focusing on a specific aspect of the evaluation process.",
              "accordions": [
                {
                  "title": "Methodology",
                  "content": "Six participants were recruited for the usability evaluation, and the data collection process was conducted remotely using Zoom calls. The recruitment process aimed to identify participants who represented the ideal user type for Best Buy's target audience. By selecting diverse participants, we ensured a comprehensive evaluation of the user experience.",
                  "tabs": [
                    {
                      "subtitle": "Persona",
                      "content": "To further understand the target users, a persona was created based on the collected data and insights gained from the participants. The persona represents the characteristics, goals, and needs of the typical Best Buy user. This persona serves as a reference point throughout the evaluation process, guiding the assessment and helping to identify areas of improvement.",
                      "image": {
                        "src": "/images/best-buy-persona.png",
                        "alt": "Best Buy Persona"
                      }
                    },
                    {
                      "subtitle": "Moderator Script",
                      "content": "n order to ensure consistency and standardized testing procedures, a moderator script was developed for the usability evaluation. The moderator script served as a guide for the moderators conducting the tests, outlining the instructions, tasks, and questions to be asked during the evaluation sessions.",
                      "content2": "To view it, please click on the following link and navigate to page 7:",
                      "CTALink1": {
                        "href": "/images/PDF/best_buy.pdf",
                        "text": "PDF Link to Best Buy Usability Report"
                      }
                    }
                  ]
                },
                {
                  "title": "Usability Test",
                  "intro": "At the beginning of the test, we introduced the project to each participant, providing them with an overview of the objectives and expectations. Following the introduction, participants were asked to fill out a pre-test questionnaire. This questionnaire aimed to gather initial information about their background, preferences, and prior experience related to the project.",

                  "tabs": [
                    {
                      "subtitle": "Usability Tasks",
                      "content": "The usability tasks were designed to evaluate specific aspects of the project's functionality and user interaction. Two of the tasks included in the test were:",
                      "heading": "First Click / Five Second / Preference Test",
                      "content1": "Participants engaged in three tests: the First Click Test, where they clicked on their initial action to evaluate interface intuitiveness; the Five Second Test, gathering feedback on impressions and design effectiveness; and the Preference Test, revealing user preferences and guiding design decisions."
                    },
                    {
                      "subtitle": "Think Aloud Tasks",
                      "content": "In addition to the usability tasks, participants were given four tasks to complete while vocalizing their thoughts and actions. This approach, known as the 'think aloud' method, enabled us to gain insights into their decision-making processes, user flow, and any difficulties or areas of confusion they encountered.",
                      "content1": "For example, one of the tasks involved using the search function to find a specific product. We closely observed the participants' process and analyzed their thinking patterns as they navigated the site, seeking to understand their search strategies, challenges faced, and overall satisfaction with the search functionality",
                      "content2": "Throughout the usability test, we took careful notes, recorded observations, and collected feedback from the participants to further analyze and evaluate the user experience."
                    }
                  ]
                },
                {
                  "title": "Reporting Results",
                  "content": "We analyzed the test results and utilized graphs for better visualization. Additionally, we implemented the System Usability Scale (SUS) to evaluate overall usability.",
                  "content1": "The successful usability test sessions uncovered areas for improvement, including addressing overwhelming options, enhancing clarity between 'in stock' and 'out of stock' items, implementing an accessible FAQ page, integrating voice activation and AI search functionality, and considering interface enhancements to strike a balance between simplicity and advanced features."
                }
              ]
            },
            "design": true
          },

          {
            "workshop": true,
            "featured": false,
            "id": "12",
            "title": "Reactulator",
            "slug": "reactulator",
            "thumbnail": "/images/reactulator.png",
            "alt": "React Calculator screenshot",
            "skills": ["React", "CSS"],
            "excerpt": "A calculator made with React.",
            "gitHubLink": "https://github.com/piracode/reactulator",
            "liveSiteLink": "https://martha.codes/reactulator/",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Details",
            "post": {
              "titleOverview": "Overview",
              "overview1": "This app is a React-based calculator that allows users to perform arithmetic calculations and store values in memory.",
              "accordions": [
                {
                  "title": "Project Requirements",
                  "content": "Create a calculator with basic arithmetic operations, memory functionality, support for decimal numbers, and the ability to change the sign of a number."
                },
                {
                  "title": "Development Highlights",
                  "intro": "During the development of this project, I focused on implementing a modular component structure and familiarizing myself with React hooks.",
                  "tabs": [
                    {
                      "subtitle": "Modular Structure",
                      "content": "The code is organized into separate components (e.g., Header, Keypad, Display) to promote reusability and maintainability. This modular approach improves code organization and makes it easier to understand and manage.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator",
                        "text": "Reactulator Repository on GitHub"
                      }
                    },
                    {
                      "subtitle": "React Hooks",
                      "content": "I utilized the useState hook to manage and update state variables in functional components. This allowed me to track and modify values like currentValue, previousValue, and memoryValue in an intuitive and efficient manner.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator/blob/master/src/components/App.js",
                        "text": "App.js Source Code on GitHub"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospective",
                  "question": "What did I learn?",
                  "content": "During the development of the calculator app, I gained hands-on experience in working with React components, managing state using hooks, and implementing calculator functionalities such as handling operator clicks, performing calculations, and managing memory. This project helped me deepen my understanding of React and enhance my skills in building interactive user interfaces.",
                  "question1": "What could be improved?",
                  "content2": "Reflecting back, there are several areas in the calculator app that could benefit from improvement.",
                  "content3": "Firstly, the code could be simplified and made less redundant through refactoring. Breaking down the logic into smaller functions and components would enhance manageability and ease of maintenance.",
                  "content4": "Moreover, adding more comments and documentation to clarify the code's purpose and functionality would enhance its understandability for others and future reference.",
                  "content5": "Lastly, exploring and implementing unit tests would ensure the reliability and robustness of the calculator app's functionalities."
                }
              ]
            },
            "design": false
          }
        ]
      },

      "fr": {
        "titleSectionProjects": "Projets sélectionnés",
        "introSelectedProjects": "Découvrez une diversité de projets, des projets phares aux expériences d'apprentissage, dans la section des Ateliers. Restez à l'écoute pour plus de mises à jour !",
        "buttonProjectTitleFeatured": "Sélectionnés",
        "buttonProjectTitleAll": "Tous",
        "buttonProjectTitleWorkshop": "Atelier",
        "projects": [
          {
            "workshop": false,
            "featured": true,
            "id": "1",
            "title": "Flixr",
            "slug": "flixr",
            "thumbnail": "/images/flix3.png",
            "thumbnailMobile": "/images/flix-mobile.png",
            "alt": "Capture d'écran de Flixr Movie",
            "skills": [
              "SCSS",
              "React",
              "RestAPI",
              "JSX",
              "PhotoShop",
              "GitHub",
              "AdobeXD"
            ],
            "excerpt": "Une base de données de films construite en React.js utilisant l'API themoviedb.org qui permet aux utilisateurs d'explorer, rechercher et marquer des films.",
            "gitHubLink": "https://github.com/piracode/flixr_react",
            "liveSiteLink": "https://martha.codes/flixr/",
            "liveSiteCTA": "Site Web",
            "gitHubCTA": "Code",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Une base de données de films construite en React.js, utilisant l'API themoviedb.org. Elle intègre une fonctionnalité permettant aux utilisateurs d'ajouter des films à leurs favoris, avec un stockage persistant assuré par le stockage local.",
              "overview2": "De plus, une maquette a été créée à l'aide de Photoshop et un prototype a été développé avec Adobe XD pour visualiser le design et les fonctionnalités de l'application.",
              "accordions": [
                {
                  "title": "Exigences du projet",
                  "content": "Le projet consistait à construire une application connectée à l'API themoviedb.org. L'exigence principale était de créer une page d'accueil affichant une grille de films, triables par popularité, meilleurs classements, sorties actuelles et prochaines sorties.",
                  "content1": "Chaque carte de film de la grille doit être liée à une page de film détaillée, présentant des informations supplémentaires telles qu'un résumé et une image de fond. De plus, une page de favoris a été mise en place pour afficher les films sélectionnés par l'utilisateur.",
                  "content2": "La possibilité d'ajouter ou de supprimer des favoris a été implémentée sur la page d'accueil, les pages de film et la page de favoris à l'aide du stockage local."
                },
                {
                  "title": "Design UX/UI",
                  "intro": "REMARQUE : Les étapes suivantes ne reflètent pas la conception de 'Flixr'. Il s'agissait d'un projet scolaire où chacun de nous travaillait individuellement sur sa propre conception. Pour la phase de développement, nous avons sélectionné une conception parmi le groupe. Cependant, je voulais quand même partager le processus que j'ai suivi et les compétences que j'ai acquises.",
                  "content": "La conception de l'application a traversé plusieurs étapes. Tout d'abord, j'ai créé un logo à l'aide d'Adobe Illustrator, puis j'ai créé une maquette avec Photoshop, et enfin j'ai développé un prototype avec Adobe XD.",
                  "tabs": [
                    {
                      "subtitle": "Suite Adobe",
                      "heading": "Illustrator",
                      "content": "Dans la section de conception de la base de données de films, je me suis inspirée de Netflix. Les éléments visuels de l'application, tels que le logo, ont été créés avec Adobe Illustrator, et le schéma de couleurs choisi était basé sur les couleurs de Netflix.",
                      "image": {
                        "src": "/images/cinevoxLogo.png",
                        "alt": "Logo de Cinevox"
                      },
                      "heading1": "Photoshop",
                      "content1": "J'ai utilisé les outils et fonctionnalités de Photoshop pour créer une maquette professionnelle et esthétique.",
                      "image1": {
                        "src": "/images/cinevox.png",
                        "alt": "Cinevox Mockup"
                      },
                      "CTALink1": {
                        "href": "https://assets.adobe.com/id/urn:aaid:sc:VA6C2:5aca45c3-aa62-4da0-a5ac-57504ff0246a?view=published",
                        "text": "Maquette Photoshop Cinevox"
                      },
                      "heading2": "Adobe XD",
                      "content2": "J'ai ensuite créé un prototype avec Adobe XD. Pour visualiser le prototype, cliquez sur les liens ci-dessous.",
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/2d9451e4-022e-49a6-832a-e6ae6c015e3f-78c7/",
                        "text": "Prototype mobile de Cinevox"
                      },
                      "CTALink3": {
                        "href": "https://xd.adobe.com/view/434de7ae-72b2-493c-9718-02b378d22115-161e/",
                        "text": "Prototype bureau de Cinevox"
                      }
                    },
                    {
                      "subtitle": "Conception finale",
                      "content": "Pendant la phase de développement en React, notre équipe de 3 personnes a convenu d'adopter la conception élaborée par un de mes camarades de classe.",
                      "content1": "Cette décision a conduit à l'intégration d'éléments de notre maquette d'origine ainsi que des contributions de notre camarade de classe dans la conception finale de la base de données de films.",
                      "content2": "Pour visualiser la conception, veuillez cliquer sur le lien suivant :",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/d9bc98ca-40b8-426c-b14c-f3ffee1e3a5a-8cef/",
                        "text": "Prototype Flixr"
                      }
                    }
                  ]
                },

                {
                  "title": "Points clés du développement",
                  "intro": "Lors de mon travail sur la base de données de films, j'ai acquis une précieuse expérience de collaboration d'équipe en utilisant GitHub.",
                  "content": "J'ai exploré diverses fonctionnalités de React qui ont grandement influencé mon expérience et ma croissance. Concentrons-nous sur deux sujets importants dans ce résumé.",
                  "tabs": [
                    {
                      "subtitle": "Fonctionnalité de recherche",
                      "heading": "Hook UseLocation",
                      "content": "Le 'hook useLocation' renvoie un objet qui représente l'URL actuel et fournit diverses propriétés et méthodes pour accéder à différentes parties de l'URL. Dans notre application, useLocation est utilisé pour obtenir l'objet de localisation actuel.",
                      "content1": "En utilisant la propriété 'location.search', qui représente la partie de la chaîne de requête de l'URL, le code extrait la valeur du paramètre 'query' de l'URL. Cela permet de récupérer la requête de recherche saisie par l'utilisateur, qui peut être utilisée pour récupérer les films pertinents ou afficher un message d'erreur si aucun film n'est trouvé.",
                      "heading1": "API URLSearchParams",
                      "content2": "URLSearchParams est une API JavaScript intégrée qui fournit des méthodes pour travailler avec la chaîne de requête d'une URL. Elle vous permet d'analyser et de manipuler les paramètres de la chaîne de requête de l'URL.",
                      "content3": "'new URLSearchParam'(location.search) crée un nouvel objet URLSearchParams en utilisant la propriété location.search, qui représente la partie de la chaîne de requête de l'URL actuel. Ensuite, .get('query') est appelé sur cet objet pour récupérer la valeur du paramètre 'query' de l'URL. Cela extrait la requête de recherche saisie par l'utilisateur.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/pages/SearchResults.js",
                        "text": "Lien GitHub"
                      }
                    },
                    {
                      "subtitle": "Récupération d'API REST",
                      "content": "Nous avons pratiqué et mis en œuvre à la fois les méthodes async/await et fetch pour la récupération de données.",
                      "heading": "Async/Await",
                      "content2": "Avec async/await, nous avons pu écrire du code asynchrone qui ressemble davantage à du code synchrone traditionnel, ce qui facilite la gestion des tâches nécessitant du temps.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/api.js",
                        "text": "Lien GitHub"
                      },
                      "heading1": "Fetch/Then/Catch",
                      "content1": "Nous avons également exploré la méthode fetch, qui nous permet d'envoyer des requêtes pour récupérer des données depuis des sources externes. En utilisant les méthodes then et catch, nous avons pu gérer efficacement la réponse et les erreurs potentielles.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/toolbelt.js",
                        "text": "Lien GitHub"
                      }
                    }
                  ]
                },
                {
                  "title": "Rétrospective",
                  "question": "Qu'ai-je appris ?",
                  "content": "Tout au long de ce projet, j'ai acquis des compétences précieuses dans la création de logos, la conception de maquettes, le développement de prototypes et React.js. Rencontrer des bogues a renforcé l'importance de tests et de débogage approfondis pour une expérience utilisateur fluide. Cette expérience a mis en évidence l'importance de la collaboration en équipe et de la communication efficace pour le succès du projet.",
                  "question1": "Qu'est-ce qui aurait pu être mieux ?",
                  "content2": "Nous avons reconnu l'importance de tests minutieux pour garantir une application robuste et fiable. De plus, nous avons identifié des bogues dans la fonctionnalité favorite après le déploiement, ce qui nécessite une refonte pour assurer un fonctionnement fluide.",
                  "content1": "De plus, il y a une opportunité d'améliorer la conception en incorporant des détails supplémentaires sur les films tels que des informations sur la distribution et des liens vidéo YouTube pour les bandes-annonces."
                }
              ]
            },
            "design": false
          },

          {
            "workshop": false,
            "featured": true,
            "id": "3",
            "title": "www.martha.codes",
            "slug": "martha-portfolio",
            "thumbnail": "/images/portfolio-desktop.png",
            "thumbnailMobile": "/images/portfolio-mobile.png",
            "skills": ["React", "JSX", "CSS", "SCSS", "JSON", "AdobeXD"],
            "excerpt": "Mon portfolio est un site multilingue qui présente un projet React où je récupère des données à partir d'une API JSON. Il propose des animations captivantes et inclut une option de thème clair/sombre, un tri de projets et des plans futurs pour ajouter une fonctionnalité de recherche par saisie.",
            "gitHubLink": "https://github.com/piracode/portfolio_CRA",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Mon projet de portfolio vise à mettre en valeur mes compétences en tant que développeur front-end et designer UX à travers une sélection soigneusement choisie de mes meilleurs travaux, reflétant mon souci du détail et mon approche centrée sur l'utilisateur.",
              "accordions": [
                {
                  "title": "Exigences du projet",
                  "content": "- Créer un portfolio professionnel et cohérent qui présente des projets sélectionnés, reflète ma marque personnelle et offre des options de contact faciles pour les employeurs potentiels.",
                  "content1": "- Développer une expérience utilisateur captivante qui communique efficacement mes compétences, mon expertise et ma passion pour le développement front-end et le design UX.",
                  "content2": "- Présenter une variété de projets, y compris des travaux sélectionnés et des projets d'entraînement, pour mettre en valeur mes capacités de résolution de problèmes, mon approche centrée sur l'utilisateur et l'impact de mon travail. De plus, incorporer des aspects de mes intérêts personnels et de mes hobbies pour fournir une vision complète de qui je suis en tant que professionnel."
                },
                {
                  "title": "Design UX/UI",
                  "intro": "",
                  "tabs": [
                    {
                      "subtitle": "Adobe XD",
                      "heading1": "Plan du site",
                      "content1": "J'ai développé un plan du site pour organiser et visualiser la structure de mon portfolio. Cela m'a permis de planifier les pages, les sections et les chemins de navigation de manière efficace, offrant une vue d'ensemble claire de l'architecture du site web. Le plan du site était une référence précieuse, garantissant un site web bien organisé.",
                      "CTALink3": {
                        "href": "/images/PDF/portfolio-site-map.pdf",
                        "text": "Plan du site PDF du portfolio"
                      },
                      "heading": "Prototype",
                      "content": "Ensuite, j'ai développé un prototype du site pour pratiquer la création de prototypes et explorer différents styles visuels. En m'inspirant du design de Brittany Chiang, j'ai incorporé des éléments qui correspondaient à ma vision. De plus, j'ai ajouté des fonctionnalités supplémentaires, notamment un thème clair/sombre, pour améliorer l'expérience utilisateur.",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/51d86c46-805d-4afe-bbd7-e86bc174db39-048b/",
                        "text": "Prototype mobile du portfolio"
                      },
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/d783c70e-7df2-47e1-af60-b05c435aa56a-82d0/",
                        "text": "Prototype bureau du portfolio"
                      }
                    },
                    {
                      "subtitle": "Design final",
                      "heading": "Navigation améliorée",
                      "content": "Après avoir reçu des retours précieux d'un enseignant, j'ai retravaillé la navigation sur mon site web. J'ai remplacé le menu hamburger par une approche plus conviviale, en veillant à ce que la navigation soit facilement accessible en bas sur mobile et sur le côté droit sur bureau. Ce changement a considérablement amélioré l'expérience de l'utilisateur.",
                      "heading1": "Site multilingue",
                      "content1": "Pour mettre en valeur mes compétences multilingues, j'ai mis en place une fonctionnalité de traduction sur mon site web. Cela permet aux utilisateurs de passer d'une langue à une autre, améliorant ainsi leur expérience de navigation et facilitant une communication efficace.",
                      "heading2": "Accordéons/Onglets",
                      "content2": "Pour assurer une présentation concise mais informative de mes projets, j'ai utilisé des accordéons et des onglets. Cela m'a permis d'inclure suffisamment de détails sans submerger l'utilisateur avec un contenu excessif, ce qui se traduit par une expérience de navigation plus organisée."
                    }
                  ]
                },
                {
                  "title": "Points clés du développement",
                  "intro": "Je souhaite mettre en avant deux aspects clés de mon processus de développement : la bibliothèque i18n et la mise en œuvre d'un thème Sombre/Clair. Ces fonctionnalités améliorent l'expérience utilisateur et l'accessibilité.",

                  "tabs": [
                    {
                      "subtitle": "Bibliothèque i18n",
                      "heading": "Fichier d'internationalisation",
                      "content": "J'ai importé les modules nécessaires pour l'internationalisation (i18n) et créé ce fichier.",
                      "content1": "Il charge les données de traduction à partir de fichiers JSON pour différentes sections de l'application, les fusionne en objets spécifiques à chaque langue et initialise la bibliothèque i18n avec les ressources chargées.",
                      "content2": "Les traductions peuvent ensuite être accédées en utilisant l'objet t dans d'autres fichiers, offrant ainsi une prise en charge multilingue pour l'application.",
                      "heading1": "Fichiers JSON",
                      "content3": "Les fichiers JSON contiennent des objets spécifiques à chaque langue avec des paires clé-valeur représentant différentes traductions. Chaque objet de langue (en, fr, es) inclut des traductions pour différentes phrases utilisées dans l'application.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/utilities/i18n.js",
                        "text": "Lien GitHub du fichier i18n"
                      }
                    },
                    {
                      "subtitle": "Thème Sombre/Clair",
                      "heading": "Hook useContext",
                      "content2": "En utilisant le hook useContext, j'ai mis en place une fonctionnalité de thème sombre/clair dans mon application. En ajoutant la classe 'light' ou 'dark' au composant de niveau supérieur, j'ai dynamiquement changé le thème en fonction des préférences de l'utilisateur. Le composant ThemeToggleButton permet aux utilisateurs de basculer entre les thèmes, et le ThemeContext fournit un accès à l'état actuel du thème dans toute l'application.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/App.js",
                        "text": "Lien GitHub vers App.js"
                      },
                      "CTALink2": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/components/ThemeToggleButton.js",
                        "text": "Lien GitHub vers ThemeToggleButton.js"
                      }
                    }
                  ]
                },
                {
                  "title": "Rétrospective",
                  "question": "Qu'ai-je appris ?",
                  "content": "Au cours de ce projet, j'ai approfondi mes connaissances en React et exploré divers hooks que je n'avais pas utilisés auparavant. L'implémentation de la bibliothèque i18n a été un objectif que j'attendais depuis longtemps et sa réalisation dans ce projet est une étape importante pour moi.",
                  "content1": "J'ai découvert que même si les bibliothèques peuvent faire gagner du temps, il est essentiel d'investir du temps pour comprendre leur utilisation. Parfois, apprendre à utiliser une bibliothèque de manière efficace peut prendre autant de temps que de développer la fonctionnalité nous-mêmes.",
                  "question1": "Qu'est-ce qui pourrait être amélioré ?",
                  "content2": "Plusieurs aspects pourraient être améliorés. J'ai précipité le développement sans planifier correctement la structure du fichier JSON. J'aurais dû garder les traductions pour chaque langue séparées au lieu de les combiner dans un seul fichier. Cette approche fonctionne bien pour la plupart des fichiers, mais rend le fichier projects.json excessivement long et difficile à maintenir. La réorganisation de cette structure est une priorité.",
                  "content3": "Je dois rectifier la manière dont j'ai accès aux traductions dans certains fichiers. Au lieu d'utiliser l'objet t, j'ai par erreur utilisé l'objet i18n, ce qui a compliqué inutilement les choses.",
                  "content5": "Je prévois d'améliorer le fichier Accordion.js en veillant à utiliser des noms cohérents pour les éléments, en ajoutant des commentaires descriptifs et en organisant le code en fonctions ou composants plus petits et modulaires. Ces changements amélioreront la lisibilité, la maintenabilité et la réutilisabilité du code.",
                  "question2": "Quelle est la suite ?",
                  "content4": "À l'avenir, je prévois d'ajouter une fonctionnalité de recherche supplémentaire qui permettra aux utilisateurs de rechercher des projets en fonction des compétences. De plus, j'ai prévu d'intégrer Google Analytics à l'avenir."
                }
              ]
            },
            "design": false
          },
          {
            "workshop": false,
            "featured": true,
            "id": "4",
            "title": "AI Summit (Prochainement)",
            "slug": "ai-summit",
            "thumbnail": "/images/placeholder.png",
            "skills": ["Wordpress", "WooCommerce", "PHP", "SASS", "GitHub"],
            "excerpt": "Nous développons actuellement un site WooCommerce au sein d'une équipe de 4 personnes. Le site a pour but de vendre des billets pour une conférence sur l'Intelligence Artificielle.",
            "gitHubLink": "https://github.com/piracode",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Détails",
            "post": {
              "intro": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia.",
              "content": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia."
            },
            "design": false
          },
          {
            "workshop": true,
            "featured": false,
            "id": "2",
            "title": "Lord of the Rings",
            "slug": "matching-game",
            "thumbnail": "/images/matchingGameDesktop.png",
            "thumbnailMobile": "/images/matchingGameMobile.png",
            "alt": "Capture d'écran du jeu Lord of The Rings",
            "skills": ["HTML", "CSS", "JavaScript"],
            "excerpt": "Un jeu de mémoire avec des effets sonores, réalisé avec JavaScript et CSS.",
            "gitHubLink": "https://github.com/piracode/matching-game/tree/master",
            "liveSiteLink": "https://martha.codes/matching-game/",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Un jeu de mémoire réalisé avec JavaScript, qui consiste en une grille de cartes que le joueur doit retourner et associer par paires, en tenant compte de ses correspondances, de ses suppositions et de ses vies restantes.",
              "accordions": [
                {
                  "title": "Exigences du projet",
                  "content": "Le jeu doit créer une expérience solo où l'utilisateur doit associer des paires d'images cachées sur une grille.",
                  "content1": "Le joueur peut révéler jusqu'à deux images à chaque tour, et si les images correspondent, elles restent révélées. Si les images ne correspondent pas, elles redeviennent cachées après un certain temps.",
                  "content2": "Le jeu doit suivre les tours du joueur, les correspondances, et fournir un bouton de démarrage ainsi que l'option de terminer le jeu à tout moment."
                },
                {
                  "title": "Points clés du développement",
                  "intro": "J'ai acquis de l'expérience dans l'utilisation de divers éléments et classes HTML, la manipulation du DOM, la mise en place de 'Event Listeners' et la gestion des variables d'état du jeu.",
                  "tabs": [
                    {
                      "subtitle": "Manipulation du DOM",
                      "content": "Tout au long du développement du jeu, j'ai travaillé en étroite collaboration avec les éléments HTML tels que les divs, les boutons, les titres et les images pour structurer et présenter l'interface utilisateur.",
                      "content1": "Dans la section de conception de la base de données de films, je me suis inspirée du design de Netflix. Les éléments visuels de l'application, tels que le logo, ont été créés à l'aide d'Adobe Illustrator, et le choix de la palette de couleurs était basé sur les couleurs de Netflix.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Lien GitHub du Jeu de Mémoire"
                      }
                    },
                    {
                      "subtitle": "Gestion de l'état du jeu",
                      "content": "Pour permettre l'interaction de l'utilisateur, j'ai mis en place des 'Event Listeners' qui réagissent aux actions telles que les clics ou les pressions de touches. En attachant ces 'Event Listeners' à des éléments HTML spécifiques, je peux déclencher les actions et les fonctions appropriées en fonction des actions de l'utilisateur.",
                      "content1": "De plus, j'ai géré les variables d'état du jeu, notamment lockCards, flippedCards, matches, guesses et livesLeft. Ces variables jouent un rôle crucial dans le suivi de la progression du jeu, la mise en place des règles et des mécanismes, le contrôle du flux du jeu et la mise à jour de l'affichage en conséquence.",
                      "content2": "Cette approche globale de la gestion des événements et de l'état du jeu a permis de créer une expérience de jeu immersive et interactive pour les joueurs.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Lien GitHub du Jeu de Mémoire"
                      }
                    }
                  ]
                },
                {
                  "title": "Rétrospective",
                  "question": "Qu'ai-je appris ?",
                  "content": "En plus de gérer les variables d'état du jeu et de manipuler le DOM, j'ai également acquis des compétences fondamentales en CSS, notamment flexbox et CSS grid. De plus, j'ai développé des connaissances et une maîtrise dans l'implémentation d'effets sonores dans le jeu.",
                  "question1": "Que pourrait être amélioré ?",
                  "content2": "Je souhaite améliorer mon code en changeant ma méthode d'approche. Actuellement, je m'appuie principalement sur les fonctions, mais j'ai l'intention d'utiliser davantage les objets. En utilisant les objets comme composants principaux de mon code, je peux le rendre mieux organisé, structuré et plus facile à réutiliser dans différentes parties du jeu. Ce changement apportera plusieurs avantages et m'aidera à créer une base de code plus efficace et plus facile à maintenir.",
                  "content1": "J'aimerais améliorer l'interface utilisateur (UI) et créer une expérience plus captivante."
                }
              ]
            },
            "design": false
          },
          {
            "workshop": false,
            "featured": true,
            "id": "8",
            "title": "French Baking - Étude de cas",
            "slug": "french-baking-case-study",
            "thumbnail": "/images/pic-frenchBaking.png",
            "skills": [
              "Recherche utilisateur",
              "Personas utilisateur",
              "Tests d'utilisabilité",
              "Conception interactive",
              "Création de maquettes",
              "Prototypage",
              "Figma"
            ],

            "excerpt": "J'ai conduit une étude de cas approfondie dans le cadre du programme Google UX Certificate, en me concentrant sur la conception d'une application fictive de pâtisserie française à l'aide de Figma",
            "liveSiteCTA": "Prototype",
            "liveSiteLink": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141&mode=design",
            "detailsCTA": "Détails",
            "pdfCTA": "PDF",
            "pdfLink": "/images/PDF/frenchBaking.pdf",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Cette étude de cas explore le développement d'une application de pâtisserie française fictive, réalisée dans le cadre du programme Google UX Certificate. Bien que la qualité de ce travail puisse ne pas atteindre mes normes les plus élevées, mon objectif est de le présenter comme un témoignage des connaissances et compétences acquises tout au long du processus. L'étude englobe différentes phases, notamment l'analyse UX, la conception UX et le prototypage, et se conclut par une évaluation rétrospective.",
              "accordions": [
                {
                  "title": "Analyse UX",
                  "tabs": [
                    {
                      "subtitle": "Compréhension du problème et recherche",
                      "heading": "Définition du problème/objectif",
                      "content": "La définition du problème/objectif de ce projet est de créer une application qui répond au défi des longues files d'attente pour les clients pressés de French Baking, leur permettant de précommander pour une récupération ou une livraison, gagnant du temps et offrant plus de commodité.",
                      "heading1": "Recherche utilisateur",
                      "content1": "Une recherche utilisateur a été menée pour comprendre les préférences et les besoins des clients cibles de French Baking. Cette recherche visait à comprendre leurs comportements de commande et à identifier les points douloureux, afin de guider le développement de l'application."
                    },
                    {
                      "subtitle": "Analyse des utilisateurs et informations",
                      "content": "Un groupe d'utilisateurs principaux identifié lors du processus de recherche était constitué d'adultes occupés qui souhaitaient une manière pratique de commander à French Baking sans faire la queue.",
                      "heading": "Identification des points de friction",
                      "content2": "Les principaux points de friction identifiés lors de la recherche utilisateur comprennent les contraintes de temps pour les adultes qui travaillent et les étudiants occupés, la déception causée par les produits en rupture de stock et l'absence d'une application permettant de précommander à la boulangerie.",
                      "heading1": "Développement de personas",
                      "content3": "Un persona détaillé nommé Nate a été créé pendant la phase de développement pour représenter l'utilisateur cible, fournissant des informations précieuses sur ses caractéristiques, ses besoins et ses objectifs. Le persona de Nate a guidé les décisions de conception et la priorisation des fonctionnalités pour l'application de French Baking.",
                      "heading2": "Carte d'expérience utilisateur",
                      "content4": "La carte d'expérience utilisateur utilisateur a identifié les points de contact, les émotions et les points de friction dans l'expérience utilisateur de l'application, révélant des informations pour une conception et un développement centrés sur l'utilisateur.",
                      "image1": {
                        "src": "/images/journeyMap.png",
                        "alt": "Carte du parcours utilisateur French Baking"
                      }
                    }
                  ]
                },
                {
                  "title": "Conception UX et prototypage",
                  "intro": "Pendant la phase de conception UX et de prototypage, plusieurs activités clés ont été réalisées pour façonner le design de l'application et créer des prototypes pour les tests et l'évaluation.",
                  "tabs": [
                    {
                      "subtitle": "Création de maquettes",
                      "heading": "Maquette papier",
                      "content": "Des croquis initiaux et des mises en page de base ont été créés sur papier pour établir la structure visuelle et l'organisation de l'application.",
                      "heading1": "Maquette numérique",
                      "content1": "Les maquettes papier ont été traduites en format numérique, permettant une visualisation plus détaillée et une conception interactive.",
                      "CTALink1": {
                        "href": "https://www.figma.com/file/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=0-1&mode=design&t=TeIG3EDCeZN8dDUH-0",
                        "text": "Lien Figma des maquettes numériques"
                      },
                      "heading2": "Prototype à basse fidélité",
                      "content2": "Un prototype à basse fidélité a été développé, offrant une représentation basique de la fonctionnalité et de l'interface utilisateur de l'application. Ce prototype a permis des tests utilisateurs précoces et des retours pour affiner la conception.",
                      "CTALink2": {
                        "href": "https://www.figma.com/proto/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=12-107&scaling=scale-down&page-id=0%3A1&starting-point-node-id=1%3A3&mode=design",
                        "text": "Lien Figma du prototype à basse fidélité"
                      }
                    },
                    {
                      "subtitle": "Résultats de l'utilisabilité",
                      "content": "Des tests d'utilisabilité ont été réalisés pour recueillir les retours et les insights des utilisateurs interagissant avec le prototype à basse fidélité. Les résultats ont permis d'identifier des problèmes d'utilisabilité, de peaufiner la conception et d'améliorer l'expérience utilisateur globale.",
                      "content1": "Les résultats de l'utilisabilité ont indiqué que les utilisateurs préféraient une page d'accueil moins encombrée, souhaitaient voir les informations sur la récupération et la livraison présentées une seule fois, et privilégiaient une section distincte pour les options personnalisées."
                    },
                    {
                      "subtitle": "Maquette",
                      "heading": "Maquette",
                      "content": "Une représentation visuelle de la conception de l'interface de l'application a été créée pour présenter l'apparence générale.",
                      "heading1": "Prototype haute fidélité",
                      "content1": "Un prototype entièrement interactif et visuellement abouti a été développé, simulant la fonctionnalité de l'application et offrant une expérience utilisateur réaliste.",
                      "content2": "NOTE : Le prototype fourni n'est pas entièrement fonctionnel, certaines fonctionnalités comme la navigation n'ont pas été implémentées. Cependant, j'ai prévu de continuer à travailler dessus pour améliorer sa fonctionnalité.",
                      "CTALink1": {
                        "href": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141",
                        "text": "Lien Figma du prototype haute fidélité"
                      }
                    }
                  ]
                },
                {
                  "title": "Rétrospective",
                  "question": "Qu'ai-je appris ?",
                  "content": "Au cours de cette étude de cas, j'ai acquis des connaissances précieuses sur différents aspects de la conception de l'expérience utilisateur, notamment la définition du problème, la recherche utilisateur, l'identification des points de friction, le développement de personas, la cartographie du parcours utilisateur, la création de maquettes, les tests d'utilisabilité et le prototypage. J'ai également appris l'importance de consacrer suffisamment de temps à chaque phase du processus de conception pour garantir des résultats de meilleure qualité.",
                  "question1": "Qu'est-ce qui pourrait être amélioré ?",
                  "content2": "J'ai précipité cette étude de cas pour obtenir le certificat UX de Google et éviter de payer des frais mensuels pendant une période prolongée. J'ai entrepris ce certificat en tant qu'expérience d'apprentissage personnelle. Malheureusement, le processus précipité a donné lieu à une interface utilisateur médiocre et à divers problèmes avec le PDF.",
                  "content3": "Malgré ses lacunes, je souhaite quand même le partager car il a fourni des insights précieux. Le calendrier précipité a compromis la qualité, mais avec mes connaissances et mon expérience accrues, je reconnais le potentiel d'amélioration significative avec plus de temps et d'efforts."
                }
              ]
            },
            "design": true
          },

          {
            "workshop": false,
            "featured": true,
            "id": "9",
            "title": "Rapport sur l'utilisabilité de Best Buy",
            "slug": "best-buy-usability-report",
            "thumbnail": "/images/best-buy-desktop.png",
            "thumbnailMobile": "/images/best-buy-mobile.png",

            "skills": [
              "Évaluation de l'utilisabilité",
              "Méthodologie de recherche",
              "Analyse des données",
              "Rédaction de rapports"
            ],
            "excerpt": "Dans le cadre d'un effort de collaboration avec une équipe de cinq personnes, nous avons réalisé un rapport complet sur l'utilisabilité pour Best Buy, évaluant son expérience utilisateur et documentant les principales conclusions.",
            "liveSiteCTA": "Prototype",
            "pdfLink": "/images/PDF/best_buy.pdf",
            "pdfCTA": "PDF",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Le rapport sur l'utilisabilité de Best Buy vise à évaluer l'expérience utilisateur et à fournir des recommandations concrètes pour l'amélioration. Le rapport se compose de plusieurs sections, chacune se concentrant sur un aspect spécifique du processus d'évaluation.",
              "accordions": [
                {
                  "title": "Méthodologie",
                  "content": "Six participants ont été recrutés pour l'évaluation de l'utilisabilité, et le processus de collecte de données s'est déroulé à distance grâce à des appels Zoom. Le processus de recrutement visait à identifier des participants représentant le type d'utilisateur idéal pour le public cible de Best Buy. En sélectionnant des participants diversifiés, nous avons assuré une évaluation complète de l'expérience utilisateur.",
                  "tabs": [
                    {
                      "subtitle": "Persona",
                      "content": "Pour mieux comprendre les utilisateurs cibles, une persona a été créée à partir des données collectées et des informations obtenues auprès des participants. Cette persona représente les caractéristiques, les objectifs et les besoins de l'utilisateur typique de Best Buy. Cette persona sert de point de référence tout au long du processus d'évaluation, guidant l'évaluation et aidant à identifier les domaines d'amélioration.",
                      "image": {
                        "src": "/images/best-buy-persona.png",
                        "alt": "Persona Best Buy"
                      }
                    },
                    {
                      "subtitle": "Script du modérateur",
                      "content": "Afin de garantir la cohérence et les procédures de test normalisées, un script du modérateur a été élaboré pour l'évaluation de l'utilisabilité. Le script du modérateur a servi de guide pour les modérateurs qui ont réalisé les tests, en fournissant les instructions, les tâches et les questions à poser lors des sessions d'évaluation.",
                      "content2": "Pour le consulter, veuillez cliquer sur le lien suivant et accéder à la page 7 :",
                      "CTALink1": {
                        "href": "/images/PDF/best_buy.pdf",
                        "text": "Lien PDF vers le rapport d'utilisabilité de Best Buy"
                      }
                    }
                  ]
                },
                {
                  "title": "Test d'utilisabilité",
                  "intro": "Au début du test, nous avons présenté le projet à chaque participant, en leur fournissant un aperçu des objectifs et des attentes. Après l'introduction, les participants ont été invités à remplir un questionnaire préalable au test. Ce questionnaire visait à recueillir des informations initiales sur leur parcours, leurs préférences et leur expérience préalable liée au projet.",

                  "tabs": [
                    {
                      "subtitle": "Tâches d'utilisabilité",
                      "content": "Les tâches d'utilisabilité ont été conçues pour évaluer des aspects spécifiques de la fonctionnalité du projet et de l'interaction utilisateur. Deux des tâches incluses dans le test étaient les suivantes :",
                      "heading": "Test du premier clic / Test des cinq secondes / Test de préférence",
                      "content1": "Les participants ont réalisé trois tests : le Test du premier clic, où ils devaient cliquer sur leur action initiale pour évaluer l'intuitivité de l'interface ; le Test des cinq secondes, qui recueillait des informations sur les impressions et l'efficacité de la conception ; et le Test de préférence, révélant les préférences des utilisateurs et guidant les décisions de conception."
                    },
                    {
                      "subtitle": "Tâches de pensée à voix haute",
                      "content": "En plus des tâches d'utilisabilité, les participants se sont vu confier quatre tâches à accomplir en exprimant à voix haute leurs pensées et actions. Cette approche, connue sous le nom de méthode de la « pensée à voix haute », nous a permis d'obtenir des informations sur leurs processus de prise de décision, leur flux d'utilisateur, ainsi que les difficultés ou les zones de confusion rencontrées.",
                      "content1": "Par exemple, l'une des tâches consistait à utiliser la fonction de recherche pour trouver un produit spécifique. Nous avons observé attentivement le processus des participants et analysé leurs schémas de pensée alors qu'ils naviguaient sur le site, cherchant à comprendre leurs stratégies de recherche, les défis rencontrés et leur satisfaction globale de la fonctionnalité de recherche.",
                      "content2": "Tout au long du test d'utilisabilité, nous avons pris des notes détaillées, enregistré les observations et recueilli les retours des participants afin de pouvoir les analyser et évaluer plus en détail l'expérience utilisateur."
                    }
                  ]
                },
                {
                  "title": "Rapport des résultats",
                  "content": "Nous avons analysé les résultats des tests et utilisé des graphiques pour une meilleure visualisation. De plus, nous avons mis en œuvre l'échelle de convivialité du système (SUS) pour évaluer la convivialité globale.",
                  "content1": "Les sessions réussies de test d'utilisabilité ont révélé des domaines à améliorer, notamment la prise en compte des options accablantes, l'amélioration de la clarté entre les articles 'en stock' et 'épuisé', la mise en place d'une page de FAQ accessible, l'intégration de la fonctionnalité de recherche vocale et d'intelligence artificielle, et la prise en compte des améliorations de l'interface pour trouver un équilibre entre simplicité et fonctionnalités avancées."
                }
              ]
            },
            "design": true
          },
          {
            "workshop": true,
            "featured": false,
            "id": "12",
            "title": "Reactulator",
            "slug": "reactulator",
            "thumbnail": "/images/reactulator.png",
            "alt": "Capture d'écran de la calculatrice React",
            "skills": ["React", "CSS"],
            "excerpt": "Une calculatrice réalisée avec React.",
            "gitHubLink": "https://github.com/piracode/reactulator",
            "liveSiteLink": "https://martha.codes/reactulator/",
            "liveSiteCTA": "Site",
            "gitHubCTA": "Code",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Aperçu",
              "overview1": "Cette application est une calculatrice basée sur React qui permet aux utilisateurs d'effectuer des calculs arithmétiques et de stocker des valeurs en mémoire.",
              "accordions": [
                {
                  "title": "Exigences du projet",
                  "content": "Créez une calculatrice avec des opérations arithmétiques de base, une fonctionnalité de mémoire, la prise en charge des nombres décimaux et la possibilité de changer le signe d'un nombre."
                },
                {
                  "title": "Moments forts du développement",
                  "intro": "Au cours du développement de ce projet, j'ai mis l'accent sur la mise en œuvre d'une structure de composants modulaires et sur la familiarisation avec les hooks React.",
                  "tabs": [
                    {
                      "subtitle": "Structure modulaire",
                      "content": "Le code est organisé en composants séparés (par exemple, Header, Keypad, Display) pour favoriser la réutilisabilité et la maintenabilité. Cette approche modulaire améliore l'organisation du code et facilite sa compréhension et sa gestion.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator",
                        "text": "Répertoire Reactulator sur GitHub"
                      }
                    },
                    {
                      "subtitle": "Hooks React",
                      "content": "J'ai utilisé le hook useState pour gérer et mettre à jour les variables d'état dans les composants fonctionnels. Cela m'a permis de suivre et de modifier les valeurs telles que currentValue, previousValue et memoryValue de manière intuitive et efficace.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator/blob/master/src/components/App.js",
                        "text": "Code source App.js sur GitHub"
                      }
                    }
                  ]
                },
                {
                  "title": "Rétrospective",
                  "question": "Qu'ai-je appris ?",
                  "content": "Pendant le développement de l'application de calculatrice, j'ai acquis une expérience pratique dans le travail avec les composants React, la gestion de l'état à l'aide de hooks et la mise en œuvre de fonctionnalités de calculatrice telles que la gestion des clics sur les opérateurs, l'exécution de calculs et la gestion de la mémoire. Ce projet m'a permis d'approfondir ma compréhension de React et d'améliorer mes compétences dans la création d'interfaces utilisateur interactives.",
                  "question1": "Qu'est-ce qui pourrait être amélioré ?",
                  "content2": "En rétrospective, plusieurs aspects de l'application de calculatrice pourraient bénéficier d'améliorations.",
                  "content3": "Tout d'abord, le code pourrait être simplifié et rendu moins redondant grâce au refactoring. La décomposition de la logique en fonctions et en composants plus petits améliorerait la gestion et la facilité de maintenance.",
                  "content4": "De plus, l'ajout de commentaires et de documentation pour clarifier le but et la fonctionnalité du code améliorerait sa compréhension pour les autres et les futures références.",
                  "content5": "Enfin, explorer et mettre en œuvre des tests unitaires garantirait la fiabilité et la robustesse des fonctionnalités de l'application de calculatrice."
                }
              ]
            },
            "design": false
          }
        ]
      },

      "es": {
        "titleSectionProjects": "Proyectos seleccionados",
        "introSelectedProjects": "Descubra una amplia variedad de proyectos, desde proyectos destacados hasta experiencias de aprendizaje, en la sección de Talleres. ¡Manténgase atento/a para más actualizaciones!",
        "buttonProjectTitleFeatured": "Destacados",
        "buttonProjectTitleAll": "Todos",
        "buttonProjectTitleWorkshop": "Taller",
        "projects": [
          {
            "workshop": false,
            "featured": true,
            "id": "1",
            "title": "Flixr",
            "slug": "flixr",
            "thumbnail": "/images/flix3.png",
            "thumbnailMobile": "/images/flix-mobile.png",
            "alt": "Flixr Movie Screenshot",
            "skills": [
              "SCSS",
              "React",
              "RestAPI",
              "JSX",
              "PhotoShop",
              "GitHub",
              "AdobeXD"
            ],
            "excerpt": "Una base de datos de películas construida en React.js que utiliza la API de themoviedb.org y permite a los usuarios explorar, buscar y marcar películas.",
            "gitHubLink": "https://github.com/piracode/flixr_react",
            "liveSiteLink": "https://martha.codes/flixr/",
            "liveSiteCTA": "Sitio",
            "gitHubCTA": "Código",
            "detailsCTA": "Detalles",
            "post": {
              "titleOverview": "Vista General",
              "overview1": "Una base de datos de películas construida en React.js que utiliza la API de themoviedb.org. Incluye la capacidad de agregar películas a favoritos, con almacenamiento persistente a través del almacenamiento local.",
              "overview2": "Además, se creó un diseño utilizando Photoshop y se desarrolló un prototipo con Adobe XD para visualizar el diseño y las funcionalidades de la aplicación.",
              "accordions": [
                {
                  "title": "Requisitos del proyecto",
                  "content": "El proyecto consistía en construir una aplicación conectada a la API de themoviedb.org. El requisito principal era crear una página de inicio que mostrara una cuadrícula de películas, ordenables por popularidad, mejores calificaciones, estrenos actuales y próximos estrenos.",
                  "content1": "Cada tarjeta de película en la cuadrícula debería enlazar a una página detallada de la película, mostrando información adicional como un resumen y una imagen de fondo. Además, se implementó una página de favoritos para mostrar las películas seleccionadas por el usuario.",
                  "content2": "Se implementó la capacidad de agregar o eliminar favoritos en la página de inicio, en las páginas de películas y en la página de favoritos utilizando el almacenamiento local."
                },
                {
                  "title": "Diseño UX/UI",
                  "intro": "NOTA: Los siguientes pasos no reflejan el diseño de 'Flixr'. Este fue un proyecto escolar en el que cada uno trabajó individualmente en su propio diseño. Para la fase de desarrollo, seleccionamos un diseño del grupo. Sin embargo, aún quería compartir el proceso que seguí y las habilidades que adquirí.",
                  "content": "El diseño de la aplicación pasó por varias etapas. En primer lugar, creé un logotipo utilizando Adobe Illustrator, luego creé una maqueta utilizando Photoshop y finalmente desarrollé un prototipo utilizando Adobe XD.",
                  "tabs": [
                    {
                      "subtitle": "Suite Adobe",
                      "heading": "Illustrator",
                      "content": "En la sección de diseño de la base de datos de películas, me inspiré en el diseño de Netflix. Los elementos visuales de la aplicación, como el logo, se crearon con Adobe Illustrator, y el esquema de colores elegido se basó en los colores de Netflix.",
                      "image": {
                        "src": "/images/cinevoxLogo.png",
                        "alt": "Logo de Cinevox"
                      },
                      "heading1": "Photoshop",
                      "content1": "Utilicé herramientas y funciones de Photoshop para crear una maqueta profesional y estética.",
                      "image1": {
                        "src": "/images/cinevox.png",
                        "alt": "Maqueta de Cinevox"
                      },
                      "CTALink1": {
                        "href": "https://assets.adobe.com/id/urn:aaid:sc:VA6C2:5aca45c3-aa62-4da0-a5ac-57504ff0246a?view=published",
                        "text": "Maqueta de Photoshop"
                      },
                      "heading2": "Adobe XD",
                      "content2": "Luego, creé un prototipo con Adobe XD. Para ver el prototipo, haz clic en los enlaces a continuación.",
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/2d9451e4-022e-49a6-832a-e6ae6c015e3f-78c7/",
                        "text": "Prototipo móvil de Cinevox"
                      },
                      "CTALink3": {
                        "href": "https://xd.adobe.com/view/434de7ae-72b2-493c-9718-02b378d22115-161e/",
                        "text": "Prototipo de escritorio de Cinevox"
                      }
                    },
                    {
                      "subtitle": "Diseño final",
                      "content": "Durante la fase de desarrollo en React, nuestro equipo de 3 personas acordó adoptar el diseño elaborado por uno de mis compañeros de clase.",
                      "content1": "Esta decisión llevó a la incorporación de elementos de diseño tanto de nuestra maqueta original como de las contribuciones de diseño de nuestro compañero de clase en el diseño final de la base de datos de películas.",
                      "content2": "Para ver el diseño, haz clic en el siguiente enlace:",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/d9bc98ca-40b8-426c-b14c-f3ffee1e3a5a-8cef/",
                        "text": "Prototipo de diseño final de Flixr"
                      }
                    }
                  ]
                },

                {
                  "title": "Puntos Claves del desarollo",
                  "intro": "Durante mi trabajo en la Base de Datos de Películas, adquirí una valiosa experiencia en la colaboración en equipo utilizando GitHub.",
                  "content": "Exploré varias características de React que influyeron mucho en mi experiencia y crecimiento. Enfoquémonos en dos temas destacados en este resumen.",
                  "tabs": [
                    {
                      "subtitle": "Funcionalidad de búsqueda",
                      "heading": "Hook useLocation",
                      "content": "El hook useLocation devuelve un objeto que representa la URL actual y proporciona varias propiedades y métodos para acceder a diferentes partes de la URL. En nuestra aplicación, useLocation se utiliza para obtener el objeto de ubicación actual.",
                      "content1": "Utilizando la propiedad location.search, que representa la parte de la cadena de consulta de la URL, el código extrae el valor del parámetro 'query' de la URL. Esto permite que el código recupere la consulta de búsqueda ingresada por el usuario, que se puede utilizar para buscar películas relevantes o mostrar un mensaje de error si no se encuentran películas.",
                      "heading1": "API URLSearchParams",
                      "content2": "URLSearchParams es una API incorporada de JavaScript que proporciona métodos para trabajar con la cadena de consulta de una URL. Permite analizar y manipular los parámetros en la cadena de consulta de la URL.",
                      "content3": "En el código anterior, new URLSearchParams(location.search) crea un nuevo objeto URLSearchParams utilizando la propiedad location.search, que representa la parte de la cadena de consulta de la URL actual. Luego, se llama a .get('query') en ese objeto para recuperar el valor del parámetro 'query' de la URL. Esto extrae la consulta de búsqueda ingresada por el usuario.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/pages/SearchResults.js",
                        "text": "Enlace a GitHub"
                      }
                    },
                    {
                      "subtitle": "Obtención de API REST",
                      "content": "Practicamos e implementamos tanto los métodos async/await como fetch para obtener datos.",
                      "heading": "Async/Await",
                      "content2": "Con async/await, pudimos escribir código asíncrono que se ve y se siente más como código síncrono tradicional, lo que facilita el manejo de tareas que requieren tiempo.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/api.js",
                        "text": "Enlace a GitHub"
                      },
                      "heading1": "Fetch/Then/Catch",
                      "content1": "También exploramos el método fetch, que nos permite enviar solicitudes para obtener datos de fuentes externas. Utilizando los métodos then y catch, pudimos manejar de manera efectiva la respuesta y los posibles errores.",
                      "CTALink2": {
                        "href": "https://github.com/piracode/flixr_react/blob/master/src/utilities/toolbelt.js",
                        "text": "Enlace a GitHub"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospectiva",
                  "question": "¿Qué aprendí?",
                  "content": "A lo largo de este proyecto, adquirí habilidades valiosas en creación de logotipos, diseño de maquetas, desarrollo de prototipos y React.js. Encontrar errores reforzó la importancia de realizar pruebas exhaustivas y depurar para lograr una experiencia de usuario fluida. Esta experiencia resaltó la importancia de corregir errores meticulosamente y refactorizar el código para mejorar la calidad general del mismo.",
                  "question1": "¿Qué se podría mejorar?",
                  "content2": "Reconocimos la importancia de realizar pruebas meticulosas para asegurar una aplicación sólida y confiable. Además, identificamos errores en la funcionalidad de favoritos después de la implementación, los cuales requieren refactorización para garantizar un funcionamiento fluido.",
                  "content1": "Además, existe la oportunidad de mejorar el diseño incorporando detalles adicionales de las películas, como información sobre el reparto y enlaces a videos de YouTube de los tráilers."
                }
              ]
            },
            "design": false
          },

          {
            "workshop": false,
            "featured": true,
            "id": "3",
            "title": "www.martha.codes",
            "slug": "martha-portfolio",
            "thumbnail": "/images/portfolio-desktop.png",
            "thumbnailMobile": "/images/portfolio-mobile.png",
            "skills": ["React", "JSX", "CSS", "SCSS", "JSON", "AdobeXD"],
            "excerpt": "Mi portafolio es un sitio multilingüe que presenta un proyecto de React donde obtengo datos de una API JSON. Ofrece animaciones cautivadoras e incluye una opción de tema claro/oscuro, ordenación de proyectos y planes futuros para agregar una función de búsqueda por entrada.",
            "gitHubLink": "https://github.com/piracode/portfolio_CRA",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Sitio",
            "gitHubCTA": "Código",
            "detailsCTA": "Detalles",
            "post": {
              "titleOverview": "Vista General",
              "overview1": "Mi proyecto de portafolio tiene como objetivo resaltar mis habilidades como desarrolladora front-end y diseñador UX a través de una cuidadosa selección de mis mejores trabajos, reflejando mi atención al detalle y enfoque centrado en el usuario.",
              "accordions": [
                {
                  "title": "Requisitos del proyecto",
                  "content": "- Crear un portafolio profesional y coherente que presente proyectos seleccionados, refleje mi marca personal y ofrezca opciones de contacto sencillas para posibles empleadores.",
                  "content1": "- Desarrollar una experiencia de usuario cautivadora que comunique de manera efectiva mis habilidades, experiencia y pasión por el desarrollo front-end y el diseño UX.",
                  "content2": "- Presentar una variedad de proyectos, incluyendo trabajos seleccionados y proyectos de entrenamiento, para resaltar mis habilidades de resolución de problemas, enfoque centrado en el usuario y el impacto de mi trabajo. Además, incorporar aspectos de mis intereses personales y hobbies para proporcionar una visión completa de quién soy como profesional."
                },
                {
                  "title": "Diseño UX/UI",
                  "intro": "",
                  "tabs": [
                    {
                      "subtitle": "Adobe XD",
                      "heading1": "Plan del sitio",
                      "content1": "He desarrollado un plan del sitio para organizar y visualizar la estructura de mi portafolio. Esto me permitió planificar las páginas, secciones y rutas de navegación de manera eficiente, brindando una vista clara de la arquitectura del sitio web. El plan del sitio fue una referencia valiosa para asegurar un sitio web bien organizado.",
                      "CTALink3": {
                        "href": "/images/PDF/portfolio-site-map.pdf",
                        "text": "Plan del sitio en PDF del portafolio"
                      },
                      "heading": "Prototipo",
                      "content": "A continuación, desarrollé un prototipo del sitio para practicar la creación de prototipos y explorar diferentes estilos visuales. Inspirado en el diseño de Brittany Chiang, incorporé elementos que se alineaban con mi visión. Además, agregué funcionalidades adicionales, como un tema claro/oscuro, para mejorar la experiencia del usuario.",
                      "CTALink1": {
                        "href": "https://xd.adobe.com/view/51d86c46-805d-4afe-bbd7-e86bc174db39-048b/",
                        "text": "Prototipo móvil del portafolio"
                      },
                      "CTALink2": {
                        "href": "https://xd.adobe.com/view/d783c70e-7df2-47e1-af60-b05c435aa56a-82d0/",
                        "text": "Prototipo de escritorio del portafolio"
                      }
                    },
                    {
                      "subtitle": "Diseño final",
                      "heading": "Navegación mejorada",
                      "content": "Después de recibir valiosos comentarios de un profesor, trabajé en la navegación de mi sitio web. Reemplacé el menú hamburguesa por un enfoque más amigable, asegurándome de que la navegación sea fácilmente accesible en la parte inferior en dispositivos móviles y en el lado derecho en escritorio. Este cambio mejoró considerablemente la experiencia del usuario.",
                      "heading1": "Sitio multilingüe",
                      "content1": "Para resaltar mis habilidades multilingües, implementé una función de traducción en mi sitio web. Esto permite a los usuarios cambiar entre idiomas, mejorando su experiencia de navegación y facilitando una comunicación efectiva.",
                      "heading2": "Acordeones/ pestañas",
                      "content2": "Para asegurar una presentación concisa pero informativa de mis proyectos, utilicé acordeones y pestañas. Esto me permitió incluir suficientes detalles sin abrumar al usuario con un contenido excesivo, lo que se traduce en una experiencia de navegación más organizada."
                    }
                  ]
                },
                {
                  "title": "Puntos clave del desarrollo",
                  "intro": "Quiero destacar dos aspectos clave de mi proceso de desarrollo: la biblioteca i18n y la implementación de un tema Oscuro/Claro. Estas características mejoran la experiencia del usuario y la accesibilidad.",

                  "tabs": [
                    {
                      "subtitle": "Biblioteca i18n",
                      "heading": "Archivo de internacionalización",
                      "content": "Importé los módulos necesarios para la internacionalización (i18n) y creé este archivo.",
                      "content1": "Carga los datos de traducción desde archivos JSON para diferentes secciones de la aplicación, los fusiona en objetos específicos para cada idioma e inicializa la biblioteca i18n con los recursos cargados.",
                      "content2": "Las traducciones luego se pueden acceder utilizando el objeto 't' en otros archivos, lo que proporciona soporte multilingüe para la aplicación.",
                      "heading1": "Archivos JSON",
                      "content3": "Los archivos JSON contienen objetos específicos para cada idioma con pares clave-valor que representan diferentes traducciones. Cada objeto de idioma (en, fr, es) incluye traducciones para diferentes frases utilizadas en la aplicación.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/utilities/i18n.js",
                        "text": "Enlace al archivo i18n en GitHub"
                      }
                    },
                    {
                      "subtitle": "Tema Oscuro/Claro",
                      "heading": "Hook useContext",
                      "content2": "Utilizando el hook useContext, implementé una funcionalidad de tema oscuro/claro en mi aplicación. Al agregar la clase 'light' o 'dark' al componente de nivel superior, cambié dinámicamente el tema según las preferencias del usuario. El componente ThemeToggleButton permite a los usuarios alternar entre los temas, y el ThemeContext proporciona acceso al estado actual del tema en toda la aplicación.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/App.js",
                        "text": "Enlace de GitHub de App.js"
                      },
                      "CTALink2": {
                        "href": "https://github.com/piracode/portfolio_cra/blob/master/src/components/ThemeToggleButton.js",
                        "text": "Enlace de GitHub de ThemeToggleButton.js"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospectiva",
                  "question": "¿Qué aprendí?",
                  "content": "Durante este proyecto, profundicé mis conocimientos en React y exploré varios hooks que no había utilizado antes. La implementación de la biblioteca i18n fue un objetivo que había estado esperando durante mucho tiempo, y lograrlo en este proyecto es un hito importante para mí.",
                  "content1": "Descubrí que aunque las bibliotecas pueden ahorrarnos tiempo, es esencial invertir tiempo en comprender cómo utilizarlas. A veces, aprender a utilizar una biblioteca de manera efectiva puede llevar tanto tiempo como desarrollar la funcionalidad nosotros mismos.",
                  "question1": "¿Qué se podría mejorar?",
                  "content2": "Varios aspectos podrían mejorarse. Apresuré el desarrollo sin planificar adecuadamente la estructura del archivo JSON. Debería haber mantenido las traducciones para cada idioma por separado en lugar de combinarlas en un solo archivo. Este enfoque funciona bien para la mayoría de los archivos, pero hace que el archivo projects.json sea excesivamente largo y difícil de mantener. Reorganizar esta estructura es una prioridad.",
                  "content3": "Debo corregir cómo accedo a las traducciones en algunos archivos. En lugar de utilizar el objeto 't', accidentalmente utilicé el objeto 'i18n', lo cual complicó innecesariamente las cosas.",
                  "content5": "Planeo mejorar el archivo Accordion.js asegurándome de utilizar nombres coherentes para los elementos, agregando comentarios descriptivos y organizando el código en funciones o componentes más pequeños y modulares. Estos cambios mejorarán la legibilidad, mantenibilidad y reutilización del código.",
                  "question2": "¿Cuál es el siguiente paso?",
                  "content4": "En el futuro, planeo agregar una funcionalidad de búsqueda adicional que permita a los usuarios buscar proyectos según sus habilidades. Además, tengo previsto integrar Google Analytics en el futuro."
                }
              ]
            },
            "design": false
          },
          {
            "workshop": false,
            "featured": true,
            "id": "4",
            "title": "Ai Summit (Próximamente)",
            "slug": "ai-summit",
            "thumbnail": "/images/placeholder.png",
            "skills": ["Wordpress", "WooCommerce", "PHP", "SASS", "GitHub"],
            "excerpt": "Actualmente estamos desarrollando un sitio de WooCommerce en un equipo de 4 personas. El sitio tiene como objetivo vender boletos para una conferencia sobre Inteligencia Artificial.",
            "gitHubLink": "https://github.com/piracode",
            "liveSiteLink": "https://martha.codes",
            "liveSiteCTA": "Sitio",
            "gitHubCTA": "Código",
            "detailsCTA": "Detalles",
            "post": {
              "intro": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia.",
              "content": "Lorem ipsum dolor sit amet. Est eligendi similique ut suscipit nemo ut cumque adipisci aut quibusdam iure cum consequatur exercitationem id molestiae similique aut dolores pariatur. Est facere dolorem et iure libero quo tenetur consequatur hic vitae optio aut error rerum eum nisi voluptas et repellat officia."
            },
            "design": false
          },
          {
            "workshop": true,
            "featured": false,
            "id": "2",
            "title": "Lord of the Rings",
            "slug": "matching-game",
            "thumbnail": "/images/matchingGameDesktop.png",
            "thumbnailMobile": "/images/matchingGameMobile.png",
            "alt": "Captura de pantalla del juego El Señor de los Anillos",
            "skills": ["HTML", "CSS", "JavaScript"],
            "excerpt": "Un juego de memoria con efectos de sonido, realizado con JavaScript y CSS.",
            "gitHubLink": "https://github.com/piracode/matching-game/tree/master",
            "liveSiteLink": "https://martha.codes/matching-game/",
            "liveSiteCTA": "Sitio",
            "gitHubCTA": "Código",
            "detailsCTA": "Detalles",
            "post": {
              "titleOverview": "Vista General",
              "overview1": "Un juego de memoria realizado con JavaScript, que consta de una cuadrícula de cartas que el jugador debe voltear y emparejar en pares, llevando un registro de sus coincidencias, intentos y vidas restantes.",
              "accordions": [
                {
                  "title": "Requisitos del proyecto",
                  "content": "El juego requiere crear una experiencia para un solo jugador donde el usuario debe emparejar pares de imágenes ocultas en una cuadrícula.",
                  "content1": "El jugador puede revelar hasta dos imágenes en cada turno, y si las imágenes coinciden, se mantienen reveladas. Si las imágenes no coinciden, vuelven a ocultarse después de cierto tiempo.",
                  "content2": "El juego debe hacer un seguimiento de los turnos del jugador, las coincidencias y proporcionar un botón de inicio y la opción de finalizar el juego en cualquier momento."
                },
                {
                  "title": "Puntos clases del desarollo",
                  "intro": "Adquirí experiencia en el uso de varios elementos y clases HTML, la manipulación del DOM, la implementación de 'Event Listeners' y la gestión de las variables de estado del juego.",
                  "tabs": [
                    {
                      "subtitle": "Manipulación del DOM",
                      "content": "A lo largo del desarrollo del juego, trabajé en estrecha colaboración con elementos HTML como divs, botones, encabezados e imágenes para estructurar y presentar la interfaz de usuario.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Enlace de GitHub del Juego de Memoria"
                      }
                    },
                    {
                      "subtitle": "Gestión del estado del juego",
                      "content": "Para permitir la interacción del usuario, implementé 'Event Listeners' que responden a acciones como clics o pulsaciones de teclas. Al adjuntar estos 'Event Listeners' a elementos HTML específicos, puedo activar acciones y funciones adecuadas según la entrada del usuario.",
                      "content1": "Además, gestioné las variables de estado del juego, incluyendo lockCards, flippedCards, matches, guesses y livesLeft. Estas variables desempeñan un papel crucial en el seguimiento del progreso del juego, la implementación de reglas y mecánicas, el control del flujo del juego y la actualización de la visualización en consecuencia.",
                      "content2": "Este enfoque integral de la gestión de eventos y el estado del juego resultó en una experiencia de juego envolvente e interactiva para los jugadores.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/matching-game",
                        "text": "Enlace de GitHub del Juego de Memoria"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospectiva",
                  "question": "¿Qué aprendí?",
                  "content": "Además de gestionar las variables de estado del juego y manipular el DOM, también adquirí habilidades fundamentales en CSS, incluyendo flexbox y CSS grid. Además, obtuve conocimientos y competencia en la implementación de efectos de sonido dentro del juego.",
                  "question1": "¿Qué se podría mejorar?",
                  "content2": "Deseo mejorar mi código cambiando mi enfoque actual. Actualmente, dependo principalmente de las funciones, pero planeo utilizar más extensivamente los objetos. Al utilizar objetos como componentes principales de mi código, puedo organizarlo, estructurarlo y hacerlo más fácil de reutilizar en diferentes partes del juego. Este cambio traerá varios beneficios y me ayudará a crear una base de código más eficiente y fácil de mantener.",
                  "content1": "Me gustaría mejorar la interfaz de usuario (UI) y crear una experiencia más cautivadora."
                }
              ]
            },
            "design": false
          },

          {
            "workshop": false,
            "featured": true,
            "id": "8",
            "title": "French Baking - Estudio de caso",
            "slug": "french-baking-case-study",
            "thumbnail": "/images/pic-frenchBaking.png",
            "skills": [
              "Investigación de usuarios",
              "Personas de usuarios",
              "Pruebas de usabilidad",
              "Diseño interactivo",
              "Creación de maquetas",
              "Prototipado",
              "Figma"
            ],

            "excerpt": "Realicé un estudio de caso exhaustivo como parte del programa Google UX Certificate, centrándome en el diseño de una aplicación ficticia de repostería francesa utilizando Figma.",
            "liveSiteCTA": "Prototipo",
            "liveSiteLink": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141&mode=design",
            "detailsCTA": "Detalles",
            "pdfCTA": "PDF",
            "pdfLink": "/images/PDF/frenchBaking.pdf",
            "post": {
              "titleOverview": "Visión general",
              "overview1": "Este estudio de caso explora el desarrollo de una aplicación ficticia de repostería francesa, realizado como parte del programa Google UX Certificate. Aunque la calidad de este trabajo puede no alcanzar mis estándares más altos, mi objetivo es presentarlo como testimonio del conocimiento y las habilidades adquiridas a lo largo del proceso. El estudio abarca diferentes fases, incluyendo el análisis UX, el diseño UX y el prototipado, y concluye con una evaluación retrospectiva.",
              "accordions": [
                {
                  "title": "Análisis UX",
                  "tabs": [
                    {
                      "subtitle": "Comprensión del problema e investigación",
                      "heading": "Definición del problema/objetivo",
                      "content": "La definición del problema/objetivo de este proyecto es crear una aplicación que aborde el desafío de las largas filas de clientes apurados en French Baking, permitiéndoles realizar pedidos anticipados para recoger o entregar, ahorrando tiempo y brindando mayor comodidad.",
                      "heading1": "Investigación de usuarios",
                      "content1": "Se realizó una investigación de usuarios para comprender las preferencias y necesidades de los clientes objetivo de French Baking. Esta investigación tenía como objetivo comprender sus comportamientos de pedido e identificar puntos de fricción para guiar el desarrollo de la aplicación."
                    },
                    {
                      "subtitle": "Análisis de usuarios e información",
                      "content": "Un grupo de usuarios principales identificado durante el proceso de investigación estaba compuesto por adultos ocupados que deseaban una forma conveniente de hacer pedidos en French Baking sin hacer cola.",
                      "heading": "Identificación de puntos de fricción",
                      "content2": "Los principales puntos de fricción identificados durante la investigación de usuarios incluyen las restricciones de tiempo para adultos que trabajan y estudiantes ocupados, la frustración causada por productos agotados y la falta de una aplicación para realizar pedidos anticipados en la panadería.",
                      "heading1": "Desarrollo de personas",
                      "content3": "Se creó una persona detallada llamada Nate durante la fase de desarrollo para representar al usuario objetivo, brindando información valiosa sobre sus características, necesidades y objetivos. La persona de Nate guió las decisiones de diseño y la priorización de características para la aplicación de French Baking.",
                      "heading2": "Mapa de experiencia del usuario",
                      "content4": "El mapa de experiencia del usuario identificó los puntos de contacto, las emociones y los puntos de fricción en la experiencia del usuario de la aplicación, revelando información para un diseño y desarrollo centrados en el usuario.",
                      "image1": {
                        "src": "/images/journeyMap.png",
                        "alt": "Mapa de experiencia del usuario French Baking"
                      }
                    }
                  ]
                },
                {
                  "title": "Diseño UX y prototipado",
                  "intro": "Durante la fase de diseño UX y prototipado, se llevaron a cabo varias actividades clave para dar forma al diseño de la aplicación y crear prototipos para pruebas y evaluación.",
                  "tabs": [
                    {
                      "subtitle": "Creación de maquetas",
                      "heading": "Maqueta en papel",
                      "content": "Se crearon bocetos iniciales y diseños básicos en papel para establecer la estructura visual y la organización de la aplicación.",
                      "heading1": "Maqueta digital",
                      "content1": "Las maquetas en papel se trasladaron a formato digital, lo que permitió una visualización más detallada y un diseño interactivo.",
                      "CTALink1": {
                        "href": "https://www.figma.com/file/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=0-1&mode=design&t=TeIG3EDCeZN8dDUH-0",
                        "text": "Enlace a las maquetas digitales en Figma"
                      },
                      "heading2": "Prototipo de baja fidelidad",
                      "content2": "Se desarrolló un prototipo de baja fidelidad que brindaba una representación básica de la funcionalidad y la interfaz de usuario de la aplicación. Este prototipo permitió pruebas tempranas con usuarios y recibir comentarios para refinar el diseño.",
                      "CTALink2": {
                        "href": "https://www.figma.com/proto/zoEExGPgKX4i9798B9yAr8/Wireframes---French-Corner?type=design&node-id=12-107&scaling=scale-down&page-id=0%3A1&starting-point-node-id=1%3A3&mode=design",
                        "text": "Enlace al prototipo de baja fidelidad en Figma"
                      }
                    },
                    {
                      "subtitle": "Resultados de usabilidad",
                      "content": "Se llevaron a cabo pruebas de usabilidad para recopilar comentarios y conocimientos de los usuarios que interactuaron con el prototipo de baja fidelidad. Los resultados permitieron identificar problemas de usabilidad, refinar el diseño y mejorar la experiencia general del usuario.",
                      "content1": "Los resultados de usabilidad indicaron que los usuarios preferían una página de inicio menos abarrotada, deseaban ver la información sobre recogida y entrega presentada una sola vez, y valoraban una sección separada para opciones personalizadas."
                    },
                    {
                      "subtitle": "Maqueta",
                      "heading": "Maqueta",
                      "content": "Se creó una representación visual del diseño de la interfaz de la aplicación para mostrar su apariencia general.",
                      "heading1": "Prototipo de alta fidelidad",
                      "content1": "Se desarrolló un prototipo completamente interactivo y visualmente completo que simula la funcionalidad de la aplicación y ofrece una experiencia de usuario realista.",
                      "content2": "NOTA: El prototipo proporcionado no es completamente funcional, algunas características como la navegación no se han implementado. Sin embargo, tengo previsto seguir trabajando en él para mejorar su funcionalidad.",
                      "CTALink1": {
                        "href": "https://www.figma.com/proto/6qM02VU9IMCsynvRiIZGGH/Untitled?node-id=5-37&starting-point-node-id=5%3A141",
                        "text": "Enlace al prototipo de alta fidelidad en Figma"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospectiva",
                  "question": "¿Qué he aprendido?",
                  "content": "Durante este estudio de caso, he adquirido conocimientos valiosos sobre diferentes aspectos del diseño de la experiencia del usuario, incluyendo la definición del problema, la investigación de usuarios, la identificación de puntos de fricción, el desarrollo de personas, el mapeo del recorrido del usuario, la creación de maquetas, las pruebas de usabilidad y el prototipado. También he aprendido la importancia de dedicar suficiente tiempo a cada fase del proceso de diseño para asegurar resultados de mayor calidad.",
                  "question1": "¿Qué se podría mejorar?",
                  "content2": "Me apresuré en este estudio de caso para obtener el certificado de UX de Google y evitar pagar tarifas mensuales durante un período prolongado. Realicé este certificado como una experiencia de aprendizaje personal. Desafortunadamente, el proceso apresurado resultó en una interfaz de usuario mediocre y varios problemas con el PDF.",
                  "content3": "A pesar de sus limitaciones, aún quiero compartirlo porque proporciona información valiosa. El cronograma apresurado comprometió la calidad, pero con mis conocimientos y experiencia mejorados, reconozco el potencial de una mejora significativa con más tiempo y esfuerzo."
                }
              ]
            },
            "design": true
          },
          {
            "workshop": false,
            "featured": true,
            "id": "9",
            "title": "Informe sobre la Usabilidad de Best Buy",
            "slug": "best-buy-usability-report",
            "thumbnail": "/images/best-buy-desktop.png",
            "thumbnailMobile": "/images/best-buy-mobile.png",

            "skills": [
              "Evaluación de Usabilidad",
              "Metodología de Investigación",
              "Análisis de Datos",
              "Redacción de Informes"
            ],
            "excerpt": "Como parte de un esfuerzo de colaboración con un equipo de cinco personas, hemos realizado un informe completo sobre la usabilidad para Best Buy, evaluando su experiencia de usuario y documentando las principales conclusiones.",
            "liveSiteCTA": "Prototype",
            "pdfLink": "/images/PDF/best_buy.pdf",
            "pdfCTA": "PDF",
            "detailsCTA": "Détails",
            "post": {
              "titleOverview": "Vista general",
              "overview1": "El informe sobre la usabilidad de Best Buy tiene como objetivo evaluar la experiencia del usuario y proporcionar recomendaciones concretas para la mejora. El informe consta de varias secciones, cada una enfocada en un aspecto específico del proceso de evaluación.",
              "accordions": [
                {
                  "title": "Metodología",
                  "content": "Se reclutaron seis participantes para la evaluación de usabilidad, y el proceso de recopilación de datos se llevó a cabo de forma remota a través de llamadas de Zoom. El proceso de reclutamiento buscó identificar participantes que representaran el tipo de usuario ideal para el público objetivo de Best Buy. Al seleccionar participantes diversos, aseguramos una evaluación completa de la experiencia del usuario.",
                  "tabs": [
                    {
                      "subtitle": "Persona",
                      "content": "Para comprender mejor a los usuarios objetivo, se creó una persona basada en los datos recopilados y la información obtenida de los participantes. Esta persona representa las características, objetivos y necesidades del usuario típico de Best Buy. Esta persona sirve como punto de referencia durante todo el proceso de evaluación, guiando la evaluación y ayudando a identificar áreas de mejora.",
                      "image": {
                        "src": "/images/best-buy-persona.png",
                        "alt": "Persona Best Buy"
                      }
                    },
                    {
                      "subtitle": "Guion del moderador",
                      "content": "Con el fin de garantizar la coherencia y los procedimientos de prueba estandarizados, se elaboró un guion del moderador para la evaluación de usabilidad. El guion del moderador sirvió como guía para los moderadores que realizaron las pruebas, proporcionando instrucciones, tareas y preguntas para las sesiones de evaluación.",
                      "content2": "Para consultarlo, por favor haz clic en el siguiente enlace y accede a la página 7:",
                      "CTALink1": {
                        "href": "/images/PDF/best_buy.pdf",
                        "text": "Enlace PDF al informe de usabilidad de Best Buy"
                      }
                    }
                  ]
                },
                {
                  "title": "Prueba de usabilidad",
                  "intro": "Al comienzo de la prueba, presentamos el proyecto a cada participante, brindándoles una visión general de los objetivos y expectativas. Después de la introducción, se les pidió a los participantes que completaran un cuestionario previo a la prueba. Este cuestionario tenía como objetivo recopilar información inicial sobre su experiencia, preferencias y experiencia previa relacionada con el proyecto.",

                  "tabs": [
                    {
                      "subtitle": "Tareas de usabilidad",
                      "content": "Las tareas de usabilidad fueron diseñadas para evaluar aspectos específicos de la funcionalidad del proyecto y la interacción del usuario. Dos de las tareas incluidas en la prueba fueron las siguientes:",
                      "heading": "Prueba de primer clic / Prueba de cinco segundos / Prueba de preferencia",
                      "content1": "Los participantes realizaron tres pruebas: la Prueba de primer clic, donde debían hacer clic en su acción inicial para evaluar la intuitividad de la interfaz; la Prueba de cinco segundos, que recopilaba información sobre las impresiones y la eficacia del diseño; y la Prueba de preferencia, que revelaba las preferencias de los usuarios y orientaba las decisiones de diseño."
                    },
                    {
                      "subtitle": "Tareas de pensamiento en voz alta",
                      "content": "Además de las tareas de usabilidad, se asignaron a los participantes cuatro tareas para realizar mientras expresaban en voz alta sus pensamientos y acciones. Este enfoque, conocido como el método de 'pensamiento en voz alta', nos permitió obtener información sobre sus procesos de toma de decisiones, flujo de usuario, así como las dificultades o áreas de confusión encontradas.",
                      "content1": "Por ejemplo, una de las tareas consistía en utilizar la función de búsqueda para encontrar un producto específico. Observamos cuidadosamente el proceso de los participantes y analizamos sus patrones de pensamiento mientras navegaban por el sitio, tratando de comprender sus estrategias de búsqueda, los desafíos encontrados y su satisfacción general con la funcionalidad de búsqueda.",
                      "content2": "A lo largo de la prueba de usabilidad, tomamos notas detalladas, registramos observaciones y recopilamos los comentarios de los participantes para poder analizarlos y evaluar en mayor detalle la experiencia del usuario."
                    }
                  ]
                },
                {
                  "title": "Informe de resultados",
                  "content": "Hemos analizado los resultados de las pruebas y los hemos visualizado mediante gráficos para una mejor comprensión. Además, hemos implementado la escala de usabilidad del sistema (SUS) para evaluar la usabilidad general.",
                  "content1": "Las sesiones exitosas de prueba de usabilidad revelaron áreas de mejora, incluyendo la consideración de opciones abrumadoras, la mejora de la claridad entre los artículos 'en stock' y 'agotados', la implementación de una página de preguntas frecuentes accesible, la integración de la funcionalidad de búsqueda por voz e inteligencia artificial, y la consideración de mejoras en la interfaz para encontrar un equilibrio entre simplicidad y funcionalidades avanzadas."
                }
              ]
            },
            "design": true
          },
          {
            "workshop": true,
            "featured": false,
            "id": "12",
            "title": "Reactulator",
            "slug": "reactulator",
            "thumbnail": "/images/reactulator.png",
            "alt": "Captura de pantalla de Reactulator",
            "skills": ["React", "CSS"],
            "excerpt": "Una calculadora creada con React.",
            "gitHubLink": "https://github.com/piracode/reactulator",
            "liveSiteLink": "https://martha.codes/reactulator/",
            "liveSiteCTA": "Sitio web",
            "gitHubCTA": "Código",
            "detailsCTA": "Detalles",
            "post": {
              "titleOverview": "Vista General",
              "overview1": "Esta aplicación es una calculadora basada en React que permite a los usuarios realizar cálculos aritméticos y almacenar valores en la memoria.",
              "accordions": [
                {
                  "title": "Requisitos del proyecto",
                  "content": "Crear una calculadora con operaciones aritméticas básicas, funcionalidad de memoria, soporte para números decimales y la capacidad de cambiar el signo de un número."
                },
                {
                  "title": "Aspectos destacados del desarrollo",
                  "intro": "Durante el desarrollo de este proyecto, me enfoqué en implementar una estructura modular de componentes y familiarizarme con los React hooks.",
                  "tabs": [
                    {
                      "subtitle": "Estructura modular",
                      "content": "El código está organizado en componentes separados (por ejemplo, Header, Keypad, Display) para promover la reutilización y mantenibilidad. Este enfoque modular mejora la organización del código y facilita su comprensión y gestión.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator",
                        "text": "Repositorio de Reactulator en GitHub"
                      }
                    },
                    {
                      "subtitle": "React Hooks",
                      "content": "Utilicé el hook useState para gestionar y actualizar las variables de estado en los componentes funcionales. Esto me permitió realizar un seguimiento y modificar valores como currentValue, previousValue y memoryValue de manera intuitiva y eficiente.",
                      "CTALink1": {
                        "href": "https://github.com/piracode/reactulator/blob/master/src/components/App.js",
                        "text": "Código fuente de App.js en GitHub"
                      }
                    }
                  ]
                },
                {
                  "title": "Retrospectiva",
                  "question": "¿Qué aprendí?",
                  "content": "Durante el desarrollo de la aplicación de calculadora, adquirí experiencia práctica en trabajar con componentes de React, gestionar el estado utilizando hooks e implementar funcionalidades de calculadora como manejar clics de operadores, realizar cálculos y gestionar la memoria. Este proyecto me ayudó a profundizar mi comprensión de React y mejorar mis habilidades en la creación de interfaces de usuario interactivas.",
                  "question1": "¿Qué se podría mejorar?",
                  "content2": "Mirando hacia atrás, hay algunas áreas que podrían mejorarse en la aplicación de calculadora.",
                  "content3": "En primer lugar, el código podría simplificarse refactorizándolo y reduciendo la redundancia. Descomponer la lógica en funciones y componentes más pequeños podría hacerlo más manejable y más fácil de mantener. ",
                  "content4": "Además, agregar más comentarios y documentación para explicar el propósito y la funcionalidad del código lo haría más comprensible para otros y para futuras referencias.",
                  "content5": " Por último, explorar e implementar pruebas unitarias podría garantizar la confiabilidad y robustez de las funcionalidades de la aplicación de calculadora."
                }
              ]
            },
            "design": false
          }
        ]
      }
    }
  }
}
